[
    {
        "post_id": "1ccf8ue",
        "title": "Apple Did Not Cut Vision Pro Production Due To Weak Demand",
        "url": "https://www.uploadvr.com/apple-vision-pro-production-cut-claims-debunked/",
        "score": 0,
        "upvotes": 0,
        "downvotes": 0,
        "num_comments": 37,
        "text": "",
        "author": "DarthBuzzard",
        "author_post_karma": 115167,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l1561d0",
                "author": "drsnafu",
                "datetime": 1714011835.0,
                "text": "VR website fighting for it's life."
            },
            {
                "comment_id": "l163rjm",
                "author": "cjwidd",
                "datetime": 1714030449.0,
                "text": "UploadVR still exists? lol wow - it was a trash rag when it started and nothing has changed, except the lawsuit of course. UploadVR makes the National Enquirer seem like a reputable source."
            },
            {
                "comment_id": "l15tms3",
                "author": "ratbum",
                "datetime": 1714023677.0,
                "text": "The source actually says this:\n> Apple cut orders before launching Vision Pro in non-US markets, which means that demand in the US market has fallen sharply beyond expectations, making Apple take a conservative view of demand in non-US markets.\n\nWildly misleading headline"
            },
            {
                "comment_id": "l16tcom",
                "author": "munkeymoney",
                "datetime": 1714046971.0,
                "text": "$3500 dust collectors"
            },
            {
                "comment_id": "l14zrf2",
                "author": "EyeLikeTheStonk",
                "datetime": 1714009373.0,
                "text": "**This is an amazing product** ... That few people actually need ... ^(And that even fewer can afford...)"
            },
            {
                "comment_id": "l14w6qt",
                "author": "phydeaux70",
                "datetime": 1714008013.0,
                "text": "Um..okay but I still don't want one and they could drop production by 95% and nobody I know would care.\n\nTwo friends bought similar items before, and it was fun at the holidays but otherwise sat unused for the year."
            },
            {
                "comment_id": "l14y3kc",
                "author": "jwhitey2004",
                "datetime": 1714008737.0,
                "text": "Sure, sure... And I still read Hustler for the articles..."
            },
            {
                "comment_id": "l1535jl",
                "author": "imaketrollfaces",
                "datetime": 1714010693.0,
                "text": "Yeah .. just like Apple doesn't give 16GB RAM in base Macbook pro model since 8GB is enough."
            },
            {
                "comment_id": "l15zbfy",
                "author": "Redditanother",
                "datetime": 1714027347.0,
                "text": "They didn’t cut production due to weak demand, they cut it due to no demand."
            },
            {
                "comment_id": "l156eo9",
                "author": "BlueLightStruct",
                "datetime": 1714011984.0,
                "text": "And what source is this coming from? Oh yes, the one that has **VR** in it's name."
            },
            {
                "comment_id": "l14x16m",
                "author": "Greatfumbler",
                "datetime": 1714008341.0,
                "text": "Remember Apple, Google, Microsoft, and any company owned by Musk or other Americans are bad. We hate technology here. Downvoted"
            }
        ]
    },
    {
        "post_id": "1ccd4jp",
        "title": "Apple’s Lead Marketer for New Vision Pro Headset Retires",
        "url": "https://www.bloomberg.com/news/articles/2024-04-24/apple-s-lead-marketer-for-new-vision-pro-headset-retires",
        "score": 61,
        "upvotes": 61,
        "downvotes": 0,
        "num_comments": 11,
        "text": "",
        "author": "BlueLightStruct",
        "author_post_karma": 46971,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l165e52",
                "author": "SophieDaDoggo",
                "datetime": 1714031648.0,
                "text": "This product was talked about for around 1 month and straight died off"
            },
            {
                "comment_id": "l17k4hn",
                "author": "shawnkfox",
                "datetime": 1714057195.0,
                "text": "Convincing people to buy a Vision Pro is certainly a legendary achievement deserving a huge retirement party.  Maybe even an induction into the marketing hall of fame."
            },
            {
                "comment_id": "l14wrls",
                "author": "redituser2571",
                "datetime": 1714008239.0,
                "text": "Taking my parachute and bailing out."
            },
            {
                "comment_id": "l162ksb",
                "author": "Klutzy-Bat-2915",
                "datetime": 1714029595.0,
                "text": "I hear he's losing his vision 😆"
            },
            {
                "comment_id": "l18hcu4",
                "author": "Glidepath22",
                "datetime": 1714070775.0,
                "text": "It has no discernible meaningful features that can’t be found for far less, what exactly was the viable selling point?"
            },
            {
                "comment_id": "l16c5s4",
                "author": "RoketRacoon",
                "datetime": 1714036762.0,
                "text": "Paywalled article"
            },
            {
                "comment_id": "l15mlz0",
                "author": "Deep-Ad2155",
                "datetime": 1714019626.0,
                "text": "lol, of course they did- wait to see all the other people leave after a few more successive quarters of terrible sales"
            },
            {
                "comment_id": "l15u9if",
                "author": "_byetony_",
                "datetime": 1714024069.0,
                "text": "Its such a cool product! I cant believe how lane the rollout went"
            },
            {
                "comment_id": "l17e5l1",
                "author": null,
                "datetime": 1714055180.0,
                "text": "[deleted]"
            }
        ]
    },
    {
        "post_id": "1cc6sbe",
        "title": "Apple reportedly slashes Vision Pro headset production and cancels updated headset as sales tank in the US",
        "url": "https://www.pcgamer.com/hardware/vr-hardware/apple-reportedly-slashes-vision-pro-headset-production-and-cancels-updated-headset-as-sales-tank-in-the-us/",
        "score": 2385,
        "upvotes": 2385,
        "downvotes": 0,
        "num_comments": 637,
        "text": "",
        "author": "lurker_bee",
        "author_post_karma": 1270307,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l13825b",
                "author": "Herdnerfer",
                "datetime": 1713986256.0,
                "text": "I bet if they took the loss and just cut the price in half sales would boom."
            },
            {
                "comment_id": "l13eq9h",
                "author": "SuperToxin",
                "datetime": 1713988436.0,
                "text": "Maybe if it was $500 or even $1000 people would buy it but who the fuck has $3000+ to throw at a very limited use VR headset?"
            },
            {
                "comment_id": "l13h664",
                "author": "dlrace",
                "datetime": 1713989238.0,
                "text": "On the one hand, I can't see a future without some sort of AR/VR. On the other, it just won't be....this."
            },
            {
                "comment_id": "l13au8u",
                "author": "Weeksy79",
                "datetime": 1713987169.0,
                "text": "SURELY they knew this wouldn’t be a mass market product? \n\nManufacturers are so cautious with production volume nowadays, it’d make more business sense for it to sell out and be hard to get like the PS5 was. \n\nHopefully they aren’t completely out of the game, there’s definitely a mass market product a few generations from now."
            },
            {
                "comment_id": "l13e71j",
                "author": "roxbie",
                "datetime": 1713988262.0,
                "text": "$499.99 gets you a Meta Quest 3.\n\nWhat kind of bullshit is apple selling?  \n\nfor $3500 that headset better connect to your brain and teleport you to paradise."
            },
            {
                "comment_id": "l13pej0",
                "author": "Ancient-Range3442",
                "datetime": 1713991930.0,
                "text": "Theres a lot of speculation in this article"
            },
            {
                "comment_id": "l13rh9f",
                "author": "ricnilotra",
                "datetime": 1713992617.0,
                "text": "What the fuck did you expect Apple?\n\nFirst: It is way overpriced for what it can do, and most people couldn't afford it, even if it wasn't a waste of money.\n\nSecond: You're Apple, so of course, it is made to be incompatible with anything that isn't an Apple product and it is a bulky hunk of shit that can't be used the way you want people to use it."
            },
            {
                "comment_id": "l13lvbv",
                "author": "DarthBuzzard",
                "datetime": 1713990770.0,
                "text": "Let's not take analysts as facts, please. Here's his previous statement a few months ago:\n\n> Kuo made similar comments earlier this week when he said that demand for the headset would cause it to sell out during pre-orders, and he believes there will be long shipping delays after the initial launch period. **Apple is expected to produce fewer than 400,000 Vision Pro headsets in 2024 due to the complexity of manufacturing. (Jan 11, 2024)**\n\nIt's conflicting. Another analyst in late 2023, Mark Gurman, also reported no more than 400,000 Vision Pro headsets were expected to be produced in 2024."
            },
            {
                "comment_id": "l13q1a0",
                "author": "Trollcifer",
                "datetime": 1713992139.0,
                "text": "Can't wait for all the other expensive shit that we don't need that's coming out to have shitty sales too.\n\nCorporations acting surprised we don't have the money for their products when they're all already squeezing us for every penny we have in every aspect of our lives."
            },
            {
                "comment_id": "l138245",
                "author": "Stunning_Bear1271",
                "datetime": 1713986256.0,
                "text": "The golden age of consumer tech hardware is over. The Google Glass. The Vision Pro. The stupid little AI pin thing. There is no real market for this shit. Period."
            },
            {
                "comment_id": "l14dd19",
                "author": "jstamper",
                "datetime": 1714000702.0,
                "text": "Its too expensive thats why it tanked"
            },
            {
                "comment_id": "l14fi50",
                "author": "SilvaCyber",
                "datetime": 1714001531.0,
                "text": "It’s not a lack of interest, it’s the high price"
            },
            {
                "comment_id": "l147hxe",
                "author": "IAMSTILLHERE2020",
                "datetime": 1713998405.0,
                "text": "People don't even want to wear glasses let alone this.."
            },
            {
                "comment_id": "l13er7i",
                "author": "shinynewmetal",
                "datetime": 1713988445.0,
                "text": "My dad has one. I tried it out. It’s absolutely amazing, no argument there. But it’s just not worth the price. No games, no new ideas, $3500 headbands, and no touch screen MacBook… It’s about time there was a change there at Apple ngl."
            },
            {
                "comment_id": "l14biux",
                "author": "NerveDull8478",
                "datetime": 1713999974.0,
                "text": "It’s too bad. I had no intention of buying one as my interests are more focused on gaming, but more participants in the vr space would have been a good thing, and Apple could have been a behemoth. \n\nIt’s strange to me how they didn’t see this coming, though. The comfort issues with vr headsets are very well known, and they would have known about the lack of software applications better than anyone.\n\nSo, they have a very expensive headset that is uncomfortable to wear for long periods and very little people can do with it.  How did they think consumers would react?\n\nIf they’d made it so people could link them to pcs and stewm, etc, it would be very different but locking it down to the apple ecosystem shuts out those who want a quality headset most."
            },
            {
                "comment_id": "l14fo2x",
                "author": "PorridgeButterwort",
                "datetime": 1714001596.0,
                "text": "Maybe if they were remotely affordable... "
            },
            {
                "comment_id": "l14om7e",
                "author": "erm1zo",
                "datetime": 1714005084.0,
                "text": "Who would have thought a $4000 VR set wouldn’t sell well?"
            },
            {
                "comment_id": "l13p7ca",
                "author": "KeepBouncing",
                "datetime": 1713991864.0,
                "text": "This gonna get posted hourly?  Yes, demand is low.  So expensive."
            },
            {
                "comment_id": "l14sds0",
                "author": "TheRauk",
                "datetime": 1714006539.0,
                "text": "20yrs from now new in box is going to be worth $1M"
            },
            {
                "comment_id": "l13jxi3",
                "author": "teddytwelvetoes",
                "datetime": 1713990142.0,
                "text": "always fun to see a lifestyle brand get a little too greedy and eat shit like this. spent so long selling casual users $2,000 web browsers that they thought this thing would fly off the shelves lol"
            },
            {
                "comment_id": "l14jw9x",
                "author": "Ninja2Night",
                "datetime": 1714003248.0,
                "text": "I wouldn’t mind having the Apple Vision Pro but the price kills it.   Think the most I can see is $1500, I want it for media consumption- Netflix, YouTube, max, etc.  it would be awesome for that.  Also I want to use my glasses, remove the eye control crap… recalled having a canon 35mm camera with eye control and felt like a gimmick."
            },
            {
                "comment_id": "l153axs",
                "author": "VirtuaFighter6",
                "datetime": 1714010752.0,
                "text": "$3500, What did you think was going to happen? They look at Meta’s numbers? That Oculus project is still in the red."
            },
            {
                "comment_id": "l13fd9q",
                "author": "sayko666",
                "datetime": 1713988642.0,
                "text": "They went to 400.000 from 800.000 which is a 50% reduction. So the next move is obvious now.\n\nStart laying off %50 of employees..."
            },
            {
                "comment_id": "l13a7av",
                "author": "Anustart2023-01",
                "datetime": 1713986961.0,
                "text": "So there's a limit to how much Apple fanatics will pay for their overpriced hardware? For 3,500 I could get an Oculus quest and a used car."
            },
            {
                "comment_id": "l13harl",
                "author": "icebeat",
                "datetime": 1713989280.0,
                "text": "Cancel update version?"
            },
            {
                "comment_id": "l13khvq",
                "author": "OrangeSlicer",
                "datetime": 1713990324.0,
                "text": "$3500 Beta Testers. Have fun? I’ll be taking my Apple Vision SE for $1299 in the future please!"
            },
            {
                "comment_id": "l13twc0",
                "author": "iamnosuperman123",
                "datetime": 1713993440.0,
                "text": "Not hugely surprising. It isn't really sold as a VR gaming headset, it is bloody expensive and it doesn't solve any particular issue outside of niche cases. Some amazing tech but it wasn't particularly well thought out when it comes to how you would even use it"
            },
            {
                "comment_id": "l13vmov",
                "author": "Meatslinger",
                "datetime": 1713994044.0,
                "text": "I've been a big fan of Apple's hardware and software ecosystem, but if they really expected mass adoption of a $3500 novelty VR headset with no PCVR support, no adult entertainment, and only a smattering of professional software, they're delusional.\n\nOh well. Maybe this means I can get one for a good knocked-down price in a few months and give it a whirl."
            },
            {
                "comment_id": "l13w2yl",
                "author": "Gloriathewitch",
                "datetime": 1713994201.0,
                "text": "the headset isn’t the issue its the lack of apps, they launched the rolls royce of headsets and all it could do was screen mirror your mac"
            },
            {
                "comment_id": "l13x3yv",
                "author": "Baron_Ultimax",
                "datetime": 1713994563.0,
                "text": "First google glass, then ms hololense, now apple vision.\n\nAR tech is pretty cool but its still a hammer looking for a nail.\n\nThe platform isnt going to take off until there is an actual use case for it."
            },
            {
                "comment_id": "l13x4a4",
                "author": "trollsmurf",
                "datetime": 1713994566.0,
                "text": "Apple can't possibly have seen this as a big-seller. Not like the $999 monitor stand. That's a must-have."
            },
            {
                "comment_id": "l13y0mv",
                "author": "420headshotsniper69",
                "datetime": 1713994885.0,
                "text": "They'll just say they were looking too far ahead for the public."
            },
            {
                "comment_id": "l13ysxx",
                "author": "Surph_Ninja",
                "datetime": 1713995165.0,
                "text": "They should’ve been dumping money into getting developers to produce a killer app WAY before launch. They got sloppy, and half-assed the launch."
            },
            {
                "comment_id": "l140wqa",
                "author": "AmericanKamikaze",
                "datetime": 1713995924.0,
                "text": "So when can I get one for $150?"
            },
            {
                "comment_id": "l1431j9",
                "author": "djordi",
                "datetime": 1713996713.0,
                "text": "Vision Pro is at the Newton level for user experience and won't be a success until it hits iPhone level for user experience."
            },
            {
                "comment_id": "l145ozi",
                "author": "Joooooooosh",
                "datetime": 1713997715.0,
                "text": "Seems odd they expected it to be a success to begin with. Felt like an R&D project. \n\nBig clunky headset was never going to be a viable mass market product and I’m sure they knew that. \n\nThat super low latency pass through is the interesting bit though. The form factor is just off… the price is almost ridiculous. "
            },
            {
                "comment_id": "l146juy",
                "author": "throwawayadhd227",
                "datetime": 1713998043.0,
                "text": "Good. That shit was dead on arrival. What a stupid product"
            },
            {
                "comment_id": "l148ar8",
                "author": "cmoz226",
                "datetime": 1713998712.0,
                "text": "But. It’s the future"
            },
            {
                "comment_id": "l14c9r6",
                "author": "fear_of_government",
                "datetime": 1714000270.0,
                "text": "Nobody is gonna pay 3500 for bloatware anymore. Let alone most don’t have it 😭"
            },
            {
                "comment_id": "l14dn7b",
                "author": "heels_n_skirt",
                "datetime": 1714000813.0,
                "text": "They should just throw it in for free with a iPhone 15 pro max purchase"
            },
            {
                "comment_id": "l14fe0w",
                "author": "dontmatterdontcare",
                "datetime": 1714001487.0,
                "text": "It's almost like they made it just for YouTubers and their tax write offs"
            },
            {
                "comment_id": "l14gdb2",
                "author": "Tenet_mma",
                "datetime": 1714001868.0,
                "text": "Well they were cool for about a week thanks to all the tech reviewers… now no one cares and they sit and collect dust."
            },
            {
                "comment_id": "l15owxj",
                "author": "Simple-Reception4262",
                "datetime": 1714020899.0,
                "text": "Stop trying to make VR happen. No one wants to strap these heavy objects to their face for prolonged periods of time just to use Facebook"
            },
            {
                "comment_id": "l160n19",
                "author": "PlutosGrasp",
                "datetime": 1714028251.0,
                "text": "We all knew it was dumb. Metaverse is dumb."
            },
            {
                "comment_id": "l1623j3",
                "author": "74389654",
                "datetime": 1714029254.0,
                "text": "well i decided to buy groceries instead"
            },
            {
                "comment_id": "l162epe",
                "author": "TheDuke2031",
                "datetime": 1714029473.0,
                "text": "Understandable they realized that vr is basically pointless anyway"
            },
            {
                "comment_id": "l16k2xe",
                "author": "Acherstrom",
                "datetime": 1714042144.0,
                "text": "When you make something only the rich one percent can buy, it may not be the best business practice."
            },
            {
                "comment_id": "l16vkps",
                "author": "Black_RL",
                "datetime": 1714047992.0,
                "text": "The tech might be cool, but no one wants to wear this kind of device……"
            },
            {
                "comment_id": "l13mbx7",
                "author": "lazazael",
                "datetime": 1713990922.0,
                "text": "the dude who pushed the fake eyes should start gardening in retirement"
            },
            {
                "comment_id": "l14c524",
                "author": "colonelc4",
                "datetime": 1714000219.0,
                "text": "3500$ should sell like hot cakes ? No ? Why ?"
            },
            {
                "comment_id": "l13phde",
                "author": "bailaoban",
                "datetime": 1713991957.0,
                "text": "I don’t understand why nobody is buying a $3500 migraine machine."
            },
            {
                "comment_id": "l13hxyz",
                "author": "TruRace",
                "datetime": 1713989491.0,
                "text": "this technology needs to be in the form of sunglasses for people to care about it. otherwise vr/ar headsets will continue to be a somewhat niche market."
            },
            {
                "comment_id": "l13ylui",
                "author": "unmondeparfait",
                "datetime": 1713995094.0,
                "text": "1) I'm glad they tried something new. The market needed some new ideas\n\n2) This probably wasn't it.\n\nI rarely praise Apple, but in this case at least they swung for the fences. I don't want one, or any of their products, but they tried. Reminds me of the 90s, when companies would go all-in on some insane product that was never going to work. We'll be back to lame ass incremental phone upgrades soon enough. Rectangles forever."
            },
            {
                "comment_id": "l145x9r",
                "author": "Sweaty-Emergency-493",
                "datetime": 1713997802.0,
                "text": "LMFAO there is nothing Apple has that can justify the cost of the AVP.\n\nNo productivity record breaking apps. No games when a Quest 2/3 is fine.\n\nIt’s all design, no function."
            },
            {
                "comment_id": "l14eoyd",
                "author": "Snoo-72756",
                "datetime": 1714001219.0,
                "text": "Literally half a price of car ,can’t watch porn ."
            },
            {
                "comment_id": "l14x85u",
                "author": "itsRobbie_",
                "datetime": 1714008414.0,
                "text": "3 grand for a wank machine isn’t the best way to spend your money"
            },
            {
                "comment_id": "l13k9em",
                "author": "Deep-Ad2155",
                "datetime": 1713990248.0,
                "text": "Everyone knows it’s a temporary filler product until the next jump in tech.  At that price point , it really has to be phenomenal and have some kind of longevity for people to invest in it.  People know x years from now next souped up model comes out."
            },
            {
                "comment_id": "l15t5o3",
                "author": "SleepySiamese",
                "datetime": 1714023379.0,
                "text": "Google glasses are for dorks.\n\nApple glasses?? Wow expensive gadget! So cooolll!!\n\nSigh. Sure dorks. make it more expensive and harder to find so people will rush to buy them. As usual. Fuck apple"
            },
            {
                "comment_id": "l13fgya",
                "author": "iskin",
                "datetime": 1713988676.0,
                "text": "And POOF! Just like that VR research and development ceased for another 20 years."
            },
            {
                "comment_id": "l13thky",
                "author": "happyscrappy",
                "datetime": 1713993299.0,
                "text": "The production slash seems very likely, almost obvious.\n\nCancelling an updated headset seems very unlikely. Apple stuck with the iPad and Watch when they started slow and managed to turn them around. I'm not saying for sure they can turn this around but I don't seem them giving up this quickly.\n\nCertainly they will make plans to improve it and cost reduce it. So if there's a cancellation of a follow-on I would expect it's just *that particular* follow-on in favor of another, perhaps one that is a little later and gets more improvements/cost cuts."
            },
            {
                "comment_id": "l13xq11",
                "author": "Madworldz",
                "datetime": 1713994780.0,
                "text": "I just can’t find the motivation to wear some heavy clunky nonsense on my head just to experience the same content I could on a typical computer. \n\nVR just won’t ever really take off the way people hope with today’s technology. Sadly it’s future depends on “full dive” features as seen in sci-fi. Give me my coffin to another world or I’ll just chill on my PC."
            },
            {
                "comment_id": "l13y4w5",
                "author": "DisheveledJesus",
                "datetime": 1713994926.0,
                "text": "If it can't play beat saber, what use is it to me? I have yet to find a compelling reason to upgrade from my OG HTC Vive I purchased in 2016."
            },
            {
                "comment_id": "l13ywaa",
                "author": "kkiran",
                "datetime": 1713995199.0,
                "text": "I gave in and bought a Quest 3 and wow isn’t that an upgrade from Quest 2! Thoroughly enjoy it and it’s lot cheaper. AVP - better luck next time. Back to drawing board, drop the unnecessary magic with fake eyes. Do something life changing. \n\nI see these in FaceBook Marketplace where users are unable to offload them. "
            },
            {
                "comment_id": "l13z37i",
                "author": "xParesh",
                "datetime": 1713995268.0,
                "text": "£200 gets you a meta quest 2 in the UK\n\n  \n[https://www.johnlewis.com/meta-quest-2-all-in-one-virtual-reality-headset-and-controllers-128gb/p5614662](https://www.johnlewis.com/meta-quest-2-all-in-one-virtual-reality-headset-and-controllers-128gb/p5614662)"
            },
            {
                "comment_id": "l140ndo",
                "author": "CamNM1991",
                "datetime": 1713995831.0,
                "text": "Oh no! Anyways"
            },
            {
                "comment_id": "l142vom",
                "author": "pchampn",
                "datetime": 1713996652.0,
                "text": "I don't understand who wants to buy this crap. No use for it. Just an expensive useless toy"
            },
            {
                "comment_id": "l144hb6",
                "author": "dburr10085",
                "datetime": 1713997254.0,
                "text": "All of the R&D that’s been spend on headsets and 3D tv’s. Neither is ever going to be the norm. We don’t like wearing extra shit on our heads."
            },
            {
                "comment_id": "l145lvn",
                "author": "The12th_secret_spice",
                "datetime": 1713997682.0,
                "text": "It is a real cool piece of tech, but there’s just not enough entertainment with it to warrant the price. It’s too expensive for an underdeveloped ecosystem."
            },
            {
                "comment_id": "l1468ql",
                "author": "myriadmeaning",
                "datetime": 1713997925.0,
                "text": "I could have told you this a year ago."
            },
            {
                "comment_id": "l1480gm",
                "author": "Tight-Physics2156",
                "datetime": 1713998602.0,
                "text": "It’s so fucking bulky. Why are we still making the same sized shit as we were 20 years ago trying for VR?!"
            },
            {
                "comment_id": "l149bkb",
                "author": "BeepboopIamabotlol",
                "datetime": 1713999106.0,
                "text": "I would have bought one if it were under $1k.. Too expensive for a fancy VR set."
            },
            {
                "comment_id": "l14byb7",
                "author": "Existing365Chocolate",
                "datetime": 1714000144.0,
                "text": "I think the future of VR is where the headset is just the visible aspect and not the computer as well"
            },
            {
                "comment_id": "l14c7uz",
                "author": "LivingDracula",
                "datetime": 1714000249.0,
                "text": "VISION NEWTON"
            },
            {
                "comment_id": "l14codi",
                "author": "sudokuma",
                "datetime": 1714000428.0,
                "text": "Any apple product has the highest cost value like it's a health device which is always costly. Selling something for at least 10x cost will end someday hopefully. Ah by the way I really hate Apple. ."
            },
            {
                "comment_id": "l14lob4",
                "author": "atticjb",
                "datetime": 1714003938.0,
                "text": "Totally would have never guessed that ppl aren’t gonna buy those wow what a shocker"
            },
            {
                "comment_id": "l14vvmu",
                "author": "duranarts",
                "datetime": 1714007894.0,
                "text": "People have caught onto the early Apple product adopter trap. Also, not going anywhere near this thing at 3k+. That’s a solid PC upgrade."
            },
            {
                "comment_id": "l14w9cz",
                "author": "Many_Caterpillar2597",
                "datetime": 1714008041.0,
                "text": "and there goes Tim Cook's half baked hardware legacy."
            },
            {
                "comment_id": "l14wsvv",
                "author": "FlacidWizardsStaff",
                "datetime": 1714008253.0,
                "text": "Cut the price, don’t make another until it can become cheaper, lighter, and more battery life"
            },
            {
                "comment_id": "l154rty",
                "author": "dorkimoe",
                "datetime": 1714011329.0,
                "text": "I’m glad this isn’t selling. Consumers are already paying outrageous prices on everything else, a line had to be drawn somewhere at the price of a gadget. I think that price is a $600 console not this"
            },
            {
                "comment_id": "l154x9i",
                "author": "buffalucci",
                "datetime": 1714011389.0,
                "text": "Because it’s stupid."
            },
            {
                "comment_id": "l155913",
                "author": "Heavy_Schedule4046",
                "datetime": 1714011521.0,
                "text": "Bigscreen beyond has the right idea. I wonder what the differences were in their budgets."
            },
            {
                "comment_id": "l156xjx",
                "author": "I_BeatDaily",
                "datetime": 1714012197.0,
                "text": "They would have probably had better luck with the car."
            },
            {
                "comment_id": "l157abc",
                "author": "TheGovernor94",
                "datetime": 1714012342.0,
                "text": "Oh who could have predicted this, aside from literally everybody"
            },
            {
                "comment_id": "l157ggs",
                "author": "BakingMadman",
                "datetime": 1714012412.0,
                "text": "Who wudda thunk that a $3500 non-necessary \"toy\" sales would tank when people are getting hit from all sides with crushing price increases and the tech sector is laying off in droves. It is a fantastic piece of technology that hit at the wrong time."
            },
            {
                "comment_id": "l157rrn",
                "author": "slvrscoobie",
                "datetime": 1714012544.0,
                "text": "AR will only be real when they can tap into your optical nerve and display directly to your brain. You just see stuff in your field of view."
            },
            {
                "comment_id": "l158cqp",
                "author": "kaji823",
                "datetime": 1714012790.0,
                "text": "People like to shit on Apple for this, but good on them for trying out new products. The only reason why so many people are upset is because they want one at a lower price point, which means they’re probably onto something. \n\nI hope they don’t trash it completely, and evolve it into a more consumer viable product in time. Maybe we’ll get some cool crossover tech in the phones and watches as a result? The AVP isn’t a product I’d purchase, but it seems like it’s full of interesting tech that one day could be."
            },
            {
                "comment_id": "l158we2",
                "author": "Mysterious-Owl4317",
                "datetime": 1714013021.0,
                "text": "Virtual reality headsets simply have no mass appeal or use case in a world absolutely drenched in smartphones and tablets."
            },
            {
                "comment_id": "l15dym7",
                "author": "WhatTheZuck420",
                "datetime": 1714015283.0,
                "text": "I’m just waiting for the one in *3 Body Problem*"
            },
            {
                "comment_id": "l15k15q",
                "author": "GloriousShroom",
                "datetime": 1714018259.0,
                "text": "It felt like a PR stunt to show that apple can still innovate "
            },
            {
                "comment_id": "l15o6lx",
                "author": "Adante_stonk",
                "datetime": 1714020492.0,
                "text": "What about the 10-20 people who bought one??"
            },
            {
                "comment_id": "l15q11a",
                "author": "buyongmafanle",
                "datetime": 1714021529.0,
                "text": "It's a beautiful piece of tech that has absolutely no use. It's the water drinking bird toy of the tech world. Novelty is its only function and once that wears off it's just another paperweight."
            },
            {
                "comment_id": "l15t5y4",
                "author": "vidivicivini",
                "datetime": 1714023384.0,
                "text": "They knew it was going to bomb, that's why they over priced it and initially intended to make a limited run.  Now they've slashed that initial run.  They just want write it off and move onto something else."
            },
            {
                "comment_id": "l166nb1",
                "author": "Bright-Union-6157",
                "datetime": 1714032580.0,
                "text": "And they really didn't see this coming?"
            },
            {
                "comment_id": "l167gtk",
                "author": "BaconJets",
                "datetime": 1714033205.0,
                "text": "They're finding out very quickly that video passthrough is a gimmick or a nice extra at best. They'll have another crack when the glasses form factor becomes real."
            },
            {
                "comment_id": "l16cpl5",
                "author": "omaca",
                "datetime": 1714037173.0,
                "text": "'tis a silly product."
            },
            {
                "comment_id": "l16h5ug",
                "author": "NewAppleChip",
                "datetime": 1714040321.0,
                "text": "I find it fascinating that Apple would think there was enough demand for this product."
            },
            {
                "comment_id": "l16h93a",
                "author": "walkinginthesky",
                "datetime": 1714040380.0,
                "text": "People are just not interested in vr except for niche uses. Plus actually using it requires having a particular space setup a particular way. Getting the equipment ready and on your face as well means it's just not very convenient to use when you have to spend 15 minutes every time getting everything situated."
            },
            {
                "comment_id": "l16qs3y",
                "author": "goldfaux",
                "datetime": 1714045730.0,
                "text": "Im still trying to figure out why Apple thought this was a good investment. Maybe if it was released 4 years ago, but not in todays market. "
            },
            {
                "comment_id": "l16tov3",
                "author": "phaedronn",
                "datetime": 1714047128.0,
                "text": "Well, I thought it would be on par in acceptance with the Virtual Boy, and it did not disappoint."
            },
            {
                "comment_id": "l16wt0g",
                "author": "Delta8ttt8",
                "datetime": 1714048535.0,
                "text": "I love it…updated model.  To me that says it all right there.  If you couldn’t come out with a version that’s so good it would take a while before it’s found to be lacking then…what are we doing here? AirPods are one thing but upgrading these ski goggles yearly? Come on meow."
            },
            {
                "comment_id": "l1727ui",
                "author": "GMon2000",
                "datetime": 1714050804.0,
                "text": "What did Apple expect? Our economy is in the chitter."
            },
            {
                "comment_id": "l172ztp",
                "author": "Life-Evidence-6672",
                "datetime": 1714051113.0,
                "text": "The problem is the novelty of vr doesn’t compensate for the shitty games and applications. Even with a system powered by a desktop the games still fall short.. there a a very few games that might be a blast but they have no population and getting in a multiplayer game is impossible."
            },
            {
                "comment_id": "l176afq",
                "author": "Fairfield1934",
                "datetime": 1714052377.0,
                "text": "It’s overpriced garbage no shit"
            },
            {
                "comment_id": "l17aovp",
                "author": "phinity_",
                "datetime": 1714053976.0,
                "text": "If Apple makes waveguide based lightweight glasses with similar feature set, that is integrated with iPhone - they will not have a sales \n problem."
            },
            {
                "comment_id": "l17cf2s",
                "author": "jsaucedo",
                "datetime": 1714054583.0,
                "text": "I feel bad for the morons that bought it"
            },
            {
                "comment_id": "l17g4gl",
                "author": "Mrjlawrence",
                "datetime": 1714055859.0,
                "text": "when does Tim Cook get his raise for this giant “success? /s"
            },
            {
                "comment_id": "l17pemh",
                "author": "Helpful-User497384",
                "datetime": 1714058939.0,
                "text": "yeah cuz its too damned expensive and for what it costs doesn't offer all that much\n\nthe meta quest 3 is a far better value"
            },
            {
                "comment_id": "l17rocr",
                "author": "ConnieLingus24",
                "datetime": 1714059685.0,
                "text": "Turns out no one wanted “Reality by Apple.” Also, my eyes hurt now with all the screens. I don’t need an apparatus in my face that makes this worse."
            },
            {
                "comment_id": "l180pde",
                "author": "hoffdec",
                "datetime": 1714062635.0,
                "text": "We are social creatures. Wearing one of these makes you anti-social. It’s a flop"
            },
            {
                "comment_id": "l14z1fq",
                "author": "mrhoopers",
                "datetime": 1714009091.0,
                "text": "Unpopular take.... (also, will be my most downvoted comment ever...for sure)\n\nReddit: Apple doesn't innovate!! They suxxxxors.\n\nApple: Okay, good point, this car thing is pretty popular, it looks like it's got legs, let's research. \n\nReddit: You're taking too long. God you suck Apple!\n\nApple: But it's hard and takes a long time.\n\nReddit: Whatever, Apple sucks, try not sucking!\n\nApple: Okay, let's also try something wild and out of the box for us. VR is popular. Let's research.\n\nReddit: Apple did a thing and it's dumb!\n\nApple: Huh, we blew a ton of cash and didn't make back a fraction of our R&D on this. \n\nReddit: Haha, Apple sucks and doesn't innovate.\n\nApple: So...what should we do?\n\nReddit: Copy Android!!!\n\nApple: <<copies Android>>\n\nReddit: Apple sucks, Android had this foreverz ago!!!\n\nApple: ...\n\n  \nHere's a thought, maybe Apple needs to stop using Reddit to get feedback because Reddit is great for some things, many things, but not for product strategy. A person can't tell you what they want, objectively. They can only tell you what they like. What? No. You're a moron! \n\nLife pro tip: people are stupid and they lie and they don't even know they're doing it.\n\nI see Apple trying a LOT of things. Sure, they've not had a \"hit\" lately...but they're trying. Who else has had a \"hit?\" No one you say? Weird!"
            },
            {
                "comment_id": "l13u5r7",
                "author": "Xenon2212",
                "datetime": 1713993530.0,
                "text": "I really don't think how they thought this could succeed. I mean it's a $3500 headset that does all the same things your laptop/tablet does, just with extra steps. It's uncomfortable, it's heavy, its fragile, it looks ridiculous, the battery life is abysmal for the price tag, I could go on. It's a ridiculous product and it deserves to die."
            },
            {
                "comment_id": "l14kt30",
                "author": "Spicyweiner_69",
                "datetime": 1714003602.0,
                "text": "Until it’s like SAO I’m not interested lol"
            },
            {
                "comment_id": "l14omo8",
                "author": "outside-is-better",
                "datetime": 1714005089.0,
                "text": "Open it up to porn and it will fly off the shelves if you can ship it in discrete packaging…"
            },
            {
                "comment_id": "l14yw1i",
                "author": "nganders",
                "datetime": 1714009034.0,
                "text": "Just saying that if \"the man\" didn't dictate no porn on this device they wouldn't be having problems with sales."
            },
            {
                "comment_id": "l1536kq",
                "author": "Photogrammaton",
                "datetime": 1714010704.0,
                "text": "Why are people complaining about the price, only costs as much as a grocery run."
            },
            {
                "comment_id": "l1641ga",
                "author": "JordtasticBagel",
                "datetime": 1714030651.0,
                "text": "Apple needs to eat the cost for a few generations. It’s a platform that could be so convenient but there’s nothing you can do with it yet and the form factor is too unwieldy."
            },
            {
                "comment_id": "l13k3wb",
                "author": "fourleggedostrich",
                "datetime": 1713990199.0,
                "text": "This is frustrating. The vision pro was a stupid product with no purpose. It was superbly made, but useless and overpriced, so of course, it tanked.\n\n\nThe problem is that this will kill VR as a platform. The meta quest is excellent, but the media will write off all of vr because apples stupid attempt failed."
            },
            {
                "comment_id": "l13g6k6",
                "author": "ExcitingLiterature33",
                "datetime": 1713988906.0,
                "text": "Lol at the people taking this sensationalist headline and running with it. Apple never intended for this to be a mass market device. It’s clearly a platform for developers until their mass market AR glasses are ready."
            },
            {
                "comment_id": "l13ozsv",
                "author": "SillyMikey",
                "datetime": 1713991795.0,
                "text": "Shocked that people aren’t into paying 3+ grand for a headset. Shocked I tell you."
            }
        ]
    },
    {
        "post_id": "1cbr213",
        "title": "Apple reportedly cuts Vision Pro production due to low demand",
        "url": "https://www.theverge.com/2024/4/23/24138487/apple-vision-pro-cut-shipment-forecast-kuo-rumor",
        "score": 1557,
        "upvotes": 1557,
        "downvotes": 0,
        "num_comments": 638,
        "text": "",
        "author": "droid_head",
        "author_post_karma": 2877,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l10aly6",
                "author": "Embarrassed_Eagle132",
                "datetime": 1713938999.0,
                "text": "I’m shocked I say, shocked!"
            },
            {
                "comment_id": "l10wgsq",
                "author": "another-social-freak",
                "datetime": 1713954824.0,
                "text": "See you guys in 2035 for the next attempt at VR"
            },
            {
                "comment_id": "l10ahpe",
                "author": "kevioshowmann",
                "datetime": 1713938920.0,
                "text": "$3500 and your competitors are selling similar products for less than 1/7th the cost"
            },
            {
                "comment_id": "l10xsp0",
                "author": "TechieAD",
                "datetime": 1713955645.0,
                "text": "I swear I saw a post about them selling out a month back and the thread full of \"reddit isn't the world\" and now we come to this"
            },
            {
                "comment_id": "l10bmnx",
                "author": "BNeutral",
                "datetime": 1713939681.0,
                "text": "Put it at $500 and I may consider it as a extra monitors for travel. $3500 is just absurd."
            },
            {
                "comment_id": "l1104is",
                "author": "Guilty-Definition-1",
                "datetime": 1713957000.0,
                "text": "Until the tech is to the point I can use it with my glasses and not look like a fool, I’ll never get it."
            },
            {
                "comment_id": "l1157kd",
                "author": "WinnieTheBish44",
                "datetime": 1713959616.0,
                "text": "The demand didn't drop, they just met the very little demand"
            },
            {
                "comment_id": "l10y2iu",
                "author": "Striking_Economy5049",
                "datetime": 1713955807.0,
                "text": "Maybe try making it somewhat affordable?"
            },
            {
                "comment_id": "l10mbmv",
                "author": "handandfoot8099",
                "datetime": 1713947517.0,
                "text": "It costs 3x as much as similar products but is limited to 1/10 the actual functionality.  How could it not be a hot item?!   /s"
            },
            {
                "comment_id": "l10xzbv",
                "author": "Owlthinkofaname",
                "datetime": 1713955755.0,
                "text": "Shocking a product that doesn't do anything other than a gimmick that costs thousands isn't doing well...\n\nPeople don't want to use VR for work! It's not a market! If they wanted to make a expensive VR headset they should've made one for industrial work."
            },
            {
                "comment_id": "l11emu2",
                "author": "Kishiloh",
                "datetime": 1713963794.0,
                "text": "Their ads for it were so out of touch. No one in their right mind take a 3k+ device that obscures your view and use it on public transportation ."
            },
            {
                "comment_id": "l1107ec",
                "author": "sziehr",
                "datetime": 1713957043.0,
                "text": "Very simple you could have priced it just above loss taken a margin hit on gen 1/2 and created a market and yet Tim just could not summon the courage to do so."
            },
            {
                "comment_id": "l10xymd",
                "author": "zeuseason",
                "datetime": 1713955743.0,
                "text": "They may have over estimated the market to drop 3500 bucks on one, tho we are talking about Apple fans."
            },
            {
                "comment_id": "l1114vr",
                "author": "SkywardLeap",
                "datetime": 1713957550.0,
                "text": "Are those of us who pointed and laughed (again) still luddites? One more time: no one wants to strap a daily use screen to their face. Just. Stop."
            },
            {
                "comment_id": "l11jz71",
                "author": "anonymous_4_custody",
                "datetime": 1713965901.0,
                "text": "I'm enough of an Apple fan that I watched the launch announcement in real time.  By the time they got done talking it up, I was willing to spend up to $1500 for it, and even then I felt like I was a bit too Apple crazy.  As soon as the price popped in, at $3,500, I was no longer in the market for a device that would further isolate me from my friends and family."
            },
            {
                "comment_id": "l10sjzp",
                "author": "MadOrange64",
                "datetime": 1713952211.0,
                "text": "Good, I’ll buy it from a scalper for half the price lol."
            },
            {
                "comment_id": "l10ttyl",
                "author": "starwarsfox",
                "datetime": 1713953108.0,
                "text": "love how people throw around 3500 but it's closer to 4k with tax"
            },
            {
                "comment_id": "l11a05j",
                "author": "80rexij",
                "datetime": 1713961823.0,
                "text": "What?? You mean people don't want to wear a heavy device that gives them headaches and black eyes? Shocking?!"
            },
            {
                "comment_id": "l11iosu",
                "author": "Old-Buffalo-5151",
                "datetime": 1713965403.0,
                "text": "Did pass the paper test.\n\nWhat is the paper test.\n\nIts a very general sense the following \n\nCan I do this faster and easier with a pencil and/or paper \n\nNow obviously you can't apply that to everything but the point is to properly measure what you're actually getting from a practical sense and VR in a general never really offers anything that's not just done better than what we currently have.\n\nIT DOES have very good use cases but its often very specialised and not for the ordinary civilians before anyone gets uppty lol"
            },
            {
                "comment_id": "l10w16j",
                "author": "_D4RKi_",
                "datetime": 1713954553.0,
                "text": "Businessmen handling technology will do business, not technology, and if they don't know about technology, they will do bad business."
            },
            {
                "comment_id": "l113u9a",
                "author": "sarhoshamiral",
                "datetime": 1713958951.0,
                "text": "Not sure what did they expect when they treated it as some hard to get item.\n\nI went to the store once while I was at the mall and asked if I can just put it on to see the screen, and see the fit with glasses and was told no. Apparently I have get an appointment and spend 30 minutes to try it on. Said good luck and left.\n\nOn the other hand best buy has a quest 3 on display that I can just put it on and try."
            },
            {
                "comment_id": "l10pdpb",
                "author": "Yoshi_87",
                "datetime": 1713949847.0,
                "text": "Apple already know how much people are willing to spend on something like this. The iPhone is a pretty good threshold.\n\n&#x200B;\n\nIf they want to replace the iPhone, it can't cost more than the iPhone. So 1000$ to maybe 1500$"
            },
            {
                "comment_id": "l1153w8",
                "author": "mayanjunglebush",
                "datetime": 1713959566.0,
                "text": "Hard to see how they can rescue this one; they can’t reduce the price by a meaningful amount to make it competitive and it’s consistently being slated as underwhelming in terms of technology and features.\n\nMaybe a second-pass at a Glass style offering would be worthwhile? Smaller profile, customisable and stylish sunglasses style AR might fare better than an uncomfortable scuba-mask."
            },
            {
                "comment_id": "l117wq4",
                "author": "danyyyel",
                "datetime": 1713960890.0,
                "text": "So they have spent all the stock of fat dudes walking on the streets doing work on Exel."
            },
            {
                "comment_id": "l118e6s",
                "author": "WatchStoredInAss",
                "datetime": 1713961110.0,
                "text": "Floppity flop flop flop."
            },
            {
                "comment_id": "l11djn8",
                "author": "Spright91",
                "datetime": 1713963340.0,
                "text": "Its $3500 and it has no games. Even if im not a gamer I would expect it to do everything any VR headset can do at that price."
            },
            {
                "comment_id": "l11keg3",
                "author": "Auzquandiance",
                "datetime": 1713966064.0,
                "text": "Good hardware, good infrastructure, terrible terrible software support, insane price. Basically an early adopter program for rich tech geeks until they find a way to drastically reduce the price."
            },
            {
                "comment_id": "l11qvcw",
                "author": "nethereus",
                "datetime": 1713968441.0,
                "text": "At $3500 it probably still sold much better than it should have, just like the cyber truck."
            },
            {
                "comment_id": "l139h45",
                "author": "SackFace",
                "datetime": 1713986726.0,
                "text": "“Why aren’t the poverty wage-stricken masses buying this at $3500 a pop?”"
            },
            {
                "comment_id": "l11fwks",
                "author": "galaxysuperstar22",
                "datetime": 1713964312.0,
                "text": "Meta does it better and cheaper"
            },
            {
                "comment_id": "l10iyrt",
                "author": "D0ngBeetle",
                "datetime": 1713944943.0,
                "text": "Waiting for all the cheap ones to hit OfferUp"
            },
            {
                "comment_id": "l10syhl",
                "author": "Zez22",
                "datetime": 1713952496.0,
                "text": "Too bloody expensive"
            },
            {
                "comment_id": "l110yes",
                "author": "Free_Management_7920",
                "datetime": 1713957455.0,
                "text": "\\*Shocked Pikachu Face\\*"
            },
            {
                "comment_id": "l113b7d",
                "author": "gavinhudson1",
                "datetime": 1713958687.0,
                "text": "I'm pretty much over VR in general tbh. I bought a quest headset several years ago. Today, I use it to fill a drawer somewhere. Maybe I'm getting old, but I'd rather spend time with people or go outside."
            },
            {
                "comment_id": "l12rt8u",
                "author": "skot77",
                "datetime": 1713980860.0,
                "text": "Sometimes I think Tim Cook is on crack.\n\nI get why they made it but to think that people are going to buy this en masse is crackhead territory."
            },
            {
                "comment_id": "l10i1oq",
                "author": "Ok_Mammoth_7303",
                "datetime": 1713944250.0,
                "text": "Who'd have thunk it?"
            },
            {
                "comment_id": "l10v60f",
                "author": "nubsauce87",
                "datetime": 1713953998.0,
                "text": "No one could ever have predicted this…"
            },
            {
                "comment_id": "l11d3hc",
                "author": "FullyAutoDracos",
                "datetime": 1713963154.0,
                "text": "Surely they didn’t think we wanted this bullshit?? Lmao what the fuck? And they wanted like 3500 for this and it’s garbage anybody that want this can get it for $500 from Apple competitors"
            },
            {
                "comment_id": "l10xysp",
                "author": "HDbear321",
                "datetime": 1713955746.0,
                "text": "Apple. Stick to releasing the same phones and AirPods."
            },
            {
                "comment_id": "l112nta",
                "author": "Happyplace_s",
                "datetime": 1713958354.0,
                "text": "They never really wanted to be in this space right now. They are just marking their territory for later and have the money to do it."
            },
            {
                "comment_id": "l112q6t",
                "author": "No-Radio-9244",
                "datetime": 1713958389.0,
                "text": "A setback for the wannabe market."
            },
            {
                "comment_id": "l113ita",
                "author": "ClassicSalty-",
                "datetime": 1713958792.0,
                "text": "No one can afford it!\n\nBut, but, but... We're Apple!\n\n................."
            },
            {
                "comment_id": "l114k1k",
                "author": "TheOneCalledMartin",
                "datetime": 1713959300.0,
                "text": "With that price and limited functions, they can't be surprised..."
            },
            {
                "comment_id": "l116d3f",
                "author": "No-Introduction-6368",
                "datetime": 1713960171.0,
                "text": "My kids like to throw things when they get frustrated. Hard pass."
            },
            {
                "comment_id": "l118g7v",
                "author": "speedtoburn",
                "datetime": 1713961135.0,
                "text": "Way too expensive for meaningful Market adoption."
            },
            {
                "comment_id": "l119i15",
                "author": "riqueoak",
                "datetime": 1713961601.0,
                "text": "Who would have thought that something useless and super expensive would not sell, I am beyond surprised. /s"
            },
            {
                "comment_id": "l11ezh6",
                "author": "plantsavier",
                "datetime": 1713963939.0,
                "text": "If NFL and NBA, or any professional sports leagues created content for Vision Pro, it would be a game changer, no pun intended. It could give users the same perspective as those courtside $30,000 seats, from the comfort of their homes! It would be worth the $3500 one time fee, plus a nominal cost to watch virtually courtside."
            },
            {
                "comment_id": "l11jxpc",
                "author": "tcoh1s",
                "datetime": 1713965886.0,
                "text": "Maybe they should cut the price instead??"
            },
            {
                "comment_id": "l11m8je",
                "author": "lookhereifyouredumb",
                "datetime": 1713966752.0,
                "text": "Guys, VR is not the problem, it’s apples ecosystem. There is simply not enough support software-wise for their walled garden VR. They’re going to shoot themselves in the foot\nThe only thing I would use Apple VR for is to edit videos using it as a laptop mirror\n\nMeanwhile Meta 3 just opened itself up like android to have anyone create for it"
            },
            {
                "comment_id": "l11r37r",
                "author": "Tea-Swiz",
                "datetime": 1713968517.0,
                "text": "All I want is a pair of AR glasses/sunglasses that display local temperatures and translate foreign languages in real time. Everything else has no practical use for most individuals on a day-to-day basis IMO."
            },
            {
                "comment_id": "l11scjo",
                "author": "therealtomclancy69",
                "datetime": 1713968961.0,
                "text": "Too expensive"
            },
            {
                "comment_id": "l11wms5",
                "author": "drjenkstah",
                "datetime": 1713970453.0,
                "text": "I’m sure the price point is not helping sales."
            },
            {
                "comment_id": "l1242vr",
                "author": "kspjrthom4444",
                "datetime": 1713972991.0,
                "text": "This is just rich people / enthusiast tech.  This does absolutely nothing for the masses.  Literally everything this offers is a luxury and niche."
            },
            {
                "comment_id": "l12642t",
                "author": "This_guy_works",
                "datetime": 1713973668.0,
                "text": "The problem with VR is that it is not a social device.  You're very closed off and in your own isolated space when using it and you can't share the experience with others around you.  Great for people who live or work alone, but very awkward for people who need to be aware of those around them.  I think that's why Apple put the facial gestures and the eye camera pass through on the Vision pro, to make the people more present with their surroundings.  But that doesn't solve the problem.\n\nI think Vision Pro would be great for education and classrooms.  Great for artists and doctors and engineers.  Anyone who needs to work with objects in a 3D space.  But the average person sitting on their couch or on the bus or walking around downtown has no need for it.  We have our pocket phones and TV's already."
            },
            {
                "comment_id": "l126bmn",
                "author": "Awkward_Tick0",
                "datetime": 1713973738.0,
                "text": "I actually really want one, but that is so much fucking money"
            },
            {
                "comment_id": "l127sac",
                "author": "Fallingdamage",
                "datetime": 1713974225.0,
                "text": "I want one. There is demand. There is little demand for a $3500 headset however."
            },
            {
                "comment_id": "l12tmiw",
                "author": "JediTrainer42",
                "datetime": 1713981458.0,
                "text": "Man, I really want this tech to succeed. I did a demo in the Apple Store and it became obvious that this device is the future of media consumption and entertainment."
            },
            {
                "comment_id": "l1392zh",
                "author": "joey0live",
                "datetime": 1713986597.0,
                "text": "If it wasn't so expensive, I'd buy one.. just for movies."
            },
            {
                "comment_id": "l15atmx",
                "author": "Ill_Mousse_4240",
                "datetime": 1714013854.0,
                "text": "Can’t believe anyone would buy this clunky thing!"
            },
            {
                "comment_id": "l112exv",
                "author": "ExperimentalToaster",
                "datetime": 1713958226.0,
                "text": "I mean, we went through this already with Google Glass and that looked less dorky."
            },
            {
                "comment_id": "l10n2ka",
                "author": "nuvo_reddit",
                "datetime": 1713948095.0,
                "text": "Somehow feel the whole VR/AR would fizzle out like 3D TV. May be wrong though."
            },
            {
                "comment_id": "l10o4bf",
                "author": "N3RO-",
                "datetime": 1713948895.0,
                "text": "(Insert shocked Pikachu meme here)"
            },
            {
                "comment_id": "l10q0c2",
                "author": "Gloriathewitch",
                "datetime": 1713950324.0,
                "text": "AVP looking like windows phone 2.0\n\na really great idea with decent hardware executed horribly"
            },
            {
                "comment_id": "l118c0k",
                "author": "potato_control",
                "datetime": 1713961082.0,
                "text": "VR and AR cause headaches for most people unless they only use it in short bursts. \n\nAs long as that keeps happening, people will keep associating getting sick with these technologies. \n\nAnd that’s exactly why they’ve had a 40% sales decline (US) in the past year and a 14% decline globally."
            },
            {
                "comment_id": "l10ny90",
                "author": "OkDragonfruit1040",
                "datetime": 1713948768.0,
                "text": "This saga is so comedic, lmao."
            },
            {
                "comment_id": "l10yiif",
                "author": "this_barb",
                "datetime": 1713956068.0,
                "text": "It was to be expected. AR/VR being held back by practically no innovation in the form factor in the last 10 years, lol."
            },
            {
                "comment_id": "l11e7ya",
                "author": "WillsMomIsFit",
                "datetime": 1713963623.0,
                "text": "the igoogles are kind of the cyber truck of apple. probably interesting to use for 10min but stupid waste of time overall."
            },
            {
                "comment_id": "l11gpo3",
                "author": "cloudsmiles",
                "datetime": 1713964633.0,
                "text": "Just get a VR headset! They are awesome, and there's so much you can do to fully immerse yourself in whatever content you desire!!"
            },
            {
                "comment_id": "l11h05z",
                "author": "Mikknoodle",
                "datetime": 1713964748.0,
                "text": "*…and the fact the goggles break when used properly.*\n\nForgot that last bit."
            },
            {
                "comment_id": "l11hiy5",
                "author": "Eborys",
                "datetime": 1713964952.0,
                "text": "Apple, well buy this shit when it’s 1/5 the price, 1/3 of the size….. and with loads more features that would be, y’know, useful enough to make such a purchase for in the first place."
            },
            {
                "comment_id": "l11hlyv",
                "author": "Nooddjob_",
                "datetime": 1713964984.0,
                "text": "These companies are so fucking out of touch.  Lower your price point to increase your volume of sales.  "
            },
            {
                "comment_id": "l11hp2p",
                "author": "G8kpr",
                "datetime": 1713965018.0,
                "text": "Have they ever released how many units they sold?"
            },
            {
                "comment_id": "l11hu0b",
                "author": "Murdock07",
                "datetime": 1713965070.0,
                "text": "I’d say the demand is high, but the price is so astronomically high that people don’t bother"
            },
            {
                "comment_id": "l11hzkw",
                "author": "spicy_capybara",
                "datetime": 1713965130.0,
                "text": "Too expensive. When they get the costs on these things down to game console prices there will be a change in adoption but it’s just too expensive for most people."
            },
            {
                "comment_id": "l11iogy",
                "author": "freetotebag",
                "datetime": 1713965399.0,
                "text": "The thing nobody wanted to turned out to be a thing nobody bought 🫨"
            },
            {
                "comment_id": "l11ji6z",
                "author": "attack_the_block",
                "datetime": 1713965720.0,
                "text": "This costs 3x what most people would be willing to spend.  Not  surprised."
            },
            {
                "comment_id": "l11l4ff",
                "author": "IAmASimulation",
                "datetime": 1713966338.0,
                "text": "Who would’ve thought there wouldn’t be demand for what amounts to a $3500 toy."
            },
            {
                "comment_id": "l11ldfa",
                "author": "Prestigious_One6691",
                "datetime": 1713966432.0,
                "text": "vr is the new 3d tv. their arnt enough people who can afford this (or care about it) for it to be more than a small industry."
            },
            {
                "comment_id": "l11lfjn",
                "author": "Big_Boxx",
                "datetime": 1713966454.0,
                "text": "If it was like, 500 bucks I’d get the new toy. \n\n3.5k? We kidding Apple? Nice try."
            },
            {
                "comment_id": "l11lmla",
                "author": "Serpentongue",
                "datetime": 1713966527.0,
                "text": "The unit and technology are awesome, but not at that price point."
            },
            {
                "comment_id": "l11luo5",
                "author": "GEM592",
                "datetime": 1713966610.0,
                "text": "I tried to tell you, I'M NOT WEARING THE GOGGLES."
            },
            {
                "comment_id": "l11m2aa",
                "author": "Epsioln_Rho_Rho",
                "datetime": 1713966689.0,
                "text": "With that price tag, how do they expect an average person justifying the cost? "
            },
            {
                "comment_id": "l11msnu",
                "author": "vinciblechunk",
                "datetime": 1713966958.0,
                "text": "Apple thinks they can shit out whatever product they want and it'll turn into money, because they've grown used to selling phones, a device people rely on for basic needs. Uh oh, turns out nobody needs VR."
            },
            {
                "comment_id": "l11mvc9",
                "author": "rpotty",
                "datetime": 1713966985.0,
                "text": "I’d buy one for $80"
            },
            {
                "comment_id": "l11n6cn",
                "author": "Kitchen-Plant664",
                "datetime": 1713967098.0,
                "text": "It’s $3500. I didn’t want to spend $350 on a quest 2, ffs"
            },
            {
                "comment_id": "l11ox0z",
                "author": "Upper-Matter-8550",
                "datetime": 1713967736.0,
                "text": "It’s 3500 bucks ! Of course no one’s buying it"
            },
            {
                "comment_id": "l11ozaq",
                "author": "RWLemon",
                "datetime": 1713967759.0,
                "text": "Of course they cut production, with that price tag you gotta be nuts to own one 😂"
            },
            {
                "comment_id": "l11p3hy",
                "author": "throwaway-10-12-20",
                "datetime": 1713967801.0,
                "text": "I saw the price tag and laughed. No one is going to spend thousands on an AR headset, lol.\n\n$400-500 at most. I knew it was going to fail before it even rolled out."
            },
            {
                "comment_id": "l11p8qs",
                "author": "Ravinac",
                "datetime": 1713967853.0,
                "text": "From everything I've heard it's really great tech that's held back by it's high price tag and Apple being Apple and refusing to let it work with anything but other Apple products. It sucks that Apple sucks."
            },
            {
                "comment_id": "l11p8rh",
                "author": "Cute_Dragonfruit9981",
                "datetime": 1713967853.0,
                "text": "Yah because it’s expensive as fuck"
            },
            {
                "comment_id": "l11pilu",
                "author": "alphonsegabrielc",
                "datetime": 1713967952.0,
                "text": "Low demand. Yes it has nothing to do with that unrealisticly high price for a toy."
            },
            {
                "comment_id": "l11pkh2",
                "author": "Solid_Illustrator640",
                "datetime": 1713967971.0,
                "text": "It is $3500 and you can’t do much with it yet. Meta Quest is way better for $500."
            },
            {
                "comment_id": "l11scpa",
                "author": "Xerenopd",
                "datetime": 1713968963.0,
                "text": "Who wants to wear an extra 10lbs on their head lmfao"
            },
            {
                "comment_id": "l11sqod",
                "author": "tungvu256",
                "datetime": 1713969098.0,
                "text": "Creating a cool tech only to severely handicap it. Typical of Apple, but this time people actually noticed"
            },
            {
                "comment_id": "l11t7qy",
                "author": "notNezter",
                "datetime": 1713969265.0,
                "text": "I was extremely excited when Apple announced AR glasses. I have a special needs child that would have benefited immensely from a polished AR product. Instead, it devolved into a VR headset. That sold for $3500.\n\nI expected nothing less from Apple. The makers of a $999 monitor stand."
            },
            {
                "comment_id": "l11tb6n",
                "author": "Enderkr",
                "datetime": 1713969299.0,
                "text": "See now, they could have been spending all this time on a hydrator for my pizza, and instead we got some stupid ass goggles that don't actually help us do anything we're not already doing."
            },
            {
                "comment_id": "l11twn9",
                "author": "ChafterMies",
                "datetime": 1713969508.0,
                "text": "I keep saying this and people keep ignoring it, but most folks don’t want to strap a computer onto their face. This won’t take off until we have AR/VR glasses."
            },
            {
                "comment_id": "l11txot",
                "author": "Lord_Blackthorn",
                "datetime": 1713969519.0,
                "text": "It's too expensive to have a large demand... What did they expect?"
            },
            {
                "comment_id": "l11tytr",
                "author": "heybart",
                "datetime": 1713969530.0,
                "text": "For once Reddit got it right!"
            },
            {
                "comment_id": "l11uuqz",
                "author": "parker1019",
                "datetime": 1713969841.0,
                "text": "Tim Cook can’t cook up anything worthwhile…."
            },
            {
                "comment_id": "l11v9o0",
                "author": "FlacidWizardsStaff",
                "datetime": 1713969984.0,
                "text": "If it weighs a ton and has low battery life, it’s not time for the product. \n \nUntil all processing can be done wirelessly and transmitted wirelessly, it’s not viable tech. Having a laptop on your face with a crappy battery pack ain’t it. I would much rather have a device in my room doing all the hard work, transmitting the results to my headset with near no latency. Since that tech doesn’t exist well enough yet, VR is still just a fad"
            },
            {
                "comment_id": "l11vn2k",
                "author": "topherrehpot",
                "datetime": 1713970114.0,
                "text": "It’s hilarious still seeing the scalper’s ads on Facebook marketplace trying to get $5k for it."
            },
            {
                "comment_id": "l11wond",
                "author": "RudegarWithFunnyHat",
                "datetime": 1713970470.0,
                "text": "less expensive and more 3d movies, and maybe a vr fallout (around this time it seems to be a big deal) and competition sure oculus Is a meta spy device but it's hella cheap in comparison"
            },
            {
                "comment_id": "l11ymnd",
                "author": "Nohat_wears_a_hat",
                "datetime": 1713971144.0,
                "text": "I really, really like VR games, VR not even games, I watched someone stream via VR from my bed one night, etc. Its fantastic but let's face the truth.\n\n$350 is too much to ask for one unless everyone starts making a much larger paycheck. The general populace from the bottom up needs a much much larger pool of disposable income to afford gimmick things like VR headsets at that price point.\n\n\nAnd Apple were asking for $3500. Yeah no. People don't have $3500 to drop on a vr set."
            },
            {
                "comment_id": "l11yoyk",
                "author": "rpcraft",
                "datetime": 1713971166.0,
                "text": "Maybe they should try cutting the price and they would see an increase in sales."
            },
            {
                "comment_id": "l11ysaf",
                "author": "Micahisaac",
                "datetime": 1713971198.0,
                "text": "I wouldn’t be interested in this for free"
            },
            {
                "comment_id": "l11zcv8",
                "author": "synackk",
                "datetime": 1713971392.0,
                "text": "I'm shocked and chagrined!"
            },
            {
                "comment_id": "l11zr0p",
                "author": "Chikenfootz",
                "datetime": 1713971527.0,
                "text": "Honest to god, I think it was totally worth the price just for movies.  Having my own personal movie theater is just freakin' awesome."
            },
            {
                "comment_id": "l1201y4",
                "author": "WestleyMc",
                "datetime": 1713971631.0,
                "text": "Thank you to the (rich) early adopters who will hopefully make the practical less expensive version of this available in ~2030!"
            },
            {
                "comment_id": "l120bl7",
                "author": "GenkiElite",
                "datetime": 1713971722.0,
                "text": "Get rid of the entire outside display and sell it for $1899.  Boom.  Next."
            },
            {
                "comment_id": "l120eza",
                "author": "mtarascio",
                "datetime": 1713971755.0,
                "text": ">possibly pushing the future of a lower-cost entry mixed reality headset beyond 2025 (if at all).\n\nWouldn't this push these plans forward if anything?"
            },
            {
                "comment_id": "l120hxo",
                "author": null,
                "datetime": 1713971783.0,
                "text": "[deleted]"
            },
            {
                "comment_id": "l121gb4",
                "author": "Rajirabbit",
                "datetime": 1713972107.0,
                "text": "Due to wrong pricing."
            },
            {
                "comment_id": "l121pau",
                "author": "Prestigious-Tea3192",
                "datetime": 1713972190.0,
                "text": "Now drop it to a 1200 range and make it less buggy and lighter and maybe maybe 🤔 you have a market"
            },
            {
                "comment_id": "l122nl9",
                "author": "killerbake",
                "datetime": 1713972512.0,
                "text": "Downvote me but they are already working on 2"
            },
            {
                "comment_id": "l122nss",
                "author": "MDA1912",
                "datetime": 1713972514.0,
                "text": "I'd buy one, for about $500."
            },
            {
                "comment_id": "l122sj4",
                "author": "NotAGayDoctor",
                "datetime": 1713972558.0,
                "text": "It costs you $1.5k to make it. (Probably less now that it's been made and you have manufacturing set up so every model made is a little cheaper than the last on cost average until you reach the true price) You charge $3.5k for it. Maybe drop the price to $2k and you'll have at least a few more buyers?"
            },
            {
                "comment_id": "l122xqh",
                "author": "Lower-Grapefruit8807",
                "datetime": 1713972607.0,
                "text": "If only everyone had warned them!"
            },
            {
                "comment_id": "l123fcy",
                "author": "poleethman",
                "datetime": 1713972772.0,
                "text": "Whoever solves the problem of VR being extremely unpleasant for people who wear glasses is going to be the king of VR. Every VR company just ignores this issue."
            },
            {
                "comment_id": "l123rwt",
                "author": "dsn0wman",
                "datetime": 1713972889.0,
                "text": "$3500 VR that can't play any video games? Apparently that's a hard sell even for Apple."
            },
            {
                "comment_id": "l1251pq",
                "author": "Nickyjtjr",
                "datetime": 1713973315.0,
                "text": "I tried one this last weekend. It’s pretty amazing. However, it’s not needed. It’s a luxury for people who like tech and don’t bat an eye at a $3k price tag. I’d be stoked to get one as a gift, but I’m not running out and buying one. That said, I did find it amazing when I tried it."
            },
            {
                "comment_id": "l126sz8",
                "author": "RyunWould",
                "datetime": 1713973897.0,
                "text": "They should come free with every cyber truck. You know, to really complete the douche Lord package."
            },
            {
                "comment_id": "l1277bo",
                "author": "Silver0044",
                "datetime": 1713974030.0,
                "text": "when nervegear"
            },
            {
                "comment_id": "l127nfb",
                "author": "spotspam",
                "datetime": 1713974179.0,
                "text": "Try “American Salaries Can’t Afford It”"
            },
            {
                "comment_id": "l12a8d2",
                "author": "PC_Fucker",
                "datetime": 1713975051.0,
                "text": "Kinda forgot about that device ngl"
            },
            {
                "comment_id": "l12bz9e",
                "author": "ProbablySlacking",
                "datetime": 1713975636.0,
                "text": "That’s the problem when you try to artificially inflate your viral marketing."
            },
            {
                "comment_id": "l12dcte",
                "author": "MyTeaWhy",
                "datetime": 1713976090.0,
                "text": "in a world that delivers bad user experience why would their goggles be any different?\n\nmaybe when these greedy companies prioritize a user experience that comes close to the potential of user experience we will be ready for something like a goggle that blocks out our vision\n\ninstead these companies would rather squabble over earnings quarter to quarter and engineer ways to increase their size"
            },
            {
                "comment_id": "l12dix4",
                "author": "anoliss",
                "datetime": 1713976147.0,
                "text": "It costs way too much money. Where are their fancy market analysts to say \"oh dear me, look at meta, their headset is a sixth of the price and just as good, let's keep our prices super high!\""
            },
            {
                "comment_id": "l12dlsu",
                "author": "redditnshitlikethat",
                "datetime": 1713976174.0,
                "text": "Who couldve seen that coming besides everyone"
            },
            {
                "comment_id": "l12duyh",
                "author": "jlawrenceforgovernor",
                "datetime": 1713976258.0,
                "text": "Lower production vs lower the price."
            },
            {
                "comment_id": "l12evam",
                "author": "NaturalSelecty",
                "datetime": 1713976595.0,
                "text": "Anyone who bought those over a Quest 3 just wanted to be a part of a trend. There was never any reason to spend that much on this headset knowing that it didn’t have anything to work with. \n\nIf you didn’t know that, then it’s completely your own fault for not doing research on a $3.5k product."
            },
            {
                "comment_id": "l12f79e",
                "author": "strong_nights",
                "datetime": 1713976705.0,
                "text": "Surprisingly no one seems to want these stupid goggles either."
            },
            {
                "comment_id": "l12hsm5",
                "author": "ukayukay69",
                "datetime": 1713977555.0,
                "text": "Huge misstep for Apple. No one was asking for this device. No one was asking to control things with their eyeballs."
            },
            {
                "comment_id": "l12k5a5",
                "author": "Rhymes_with_cheese",
                "datetime": 1713978336.0,
                "text": "I didn't see that coming.\n\n...\n\n/s"
            },
            {
                "comment_id": "l12kcu1",
                "author": "Rhymes_with_cheese",
                "datetime": 1713978405.0,
                "text": "That's what I call...\n\n<removes Quest3 headset>\n\niAwkward"
            },
            {
                "comment_id": "l12kwv7",
                "author": "SkittlesNTwix",
                "datetime": 1713978590.0,
                "text": "Beyond *whose* expectations..? haha"
            },
            {
                "comment_id": "l12kxdu",
                "author": "Art-RJS",
                "datetime": 1713978595.0,
                "text": "Price is prohibitive"
            },
            {
                "comment_id": "l12lais",
                "author": "Zaynara",
                "datetime": 1713978718.0,
                "text": "a rich people's toy with a rich people's price? what do you mean its not marketable to the poor pennyless masses?"
            },
            {
                "comment_id": "l12mfwj",
                "author": "Oli_Picard",
                "datetime": 1713979099.0,
                "text": "I walked into an Apple shop expecting to see a Vision Pro headset and couldn’t see them on display at all. It’s the first time I’ve stepped into an Apple Store and felt disappointed."
            },
            {
                "comment_id": "l12nfvx",
                "author": "Any-Double857",
                "datetime": 1713979427.0,
                "text": "Immersive media viewing? I’d rather go to the movie theater or watch in my own home theater. Shit you could build out a good starter one for $3,500. You can get a projector that will give you a 200in screen for $500-1000 nowadays. Leaving 2.5-3k for audio and seating."
            },
            {
                "comment_id": "l12rog0",
                "author": "UrHeroandVillain",
                "datetime": 1713980816.0,
                "text": "Alright perfect. I’ll get one of those bad boys used a year from now"
            },
            {
                "comment_id": "l12y3tc",
                "author": "irextra",
                "datetime": 1713982945.0,
                "text": "they need to remake their ui for that gonna take years"
            },
            {
                "comment_id": "l130jpc",
                "author": "Th0rHere",
                "datetime": 1713983756.0,
                "text": "They can't reduce the price to increase uptake. It will really piss off the folks that spent full retail to early adopt at ridiculous prices.\n\n\nNot sure how Apple thought this was going to become a thing at this price point. "
            },
            {
                "comment_id": "l13ooyj",
                "author": "Nomad_Industries",
                "datetime": 1713991694.0,
                "text": "Thus always for solutions looking for problems."
            },
            {
                "comment_id": "l13tl3l",
                "author": "GrayBox1313",
                "datetime": 1713993333.0,
                "text": "If apple can’t make VR a thing it’s prob not gonna be one"
            },
            {
                "comment_id": "l14ilw0",
                "author": "mark503",
                "datetime": 1714002739.0,
                "text": "Who wants to wear ski goggles while browsing their Facebook.  I can do social media without trying g to look like Shaun white."
            },
            {
                "comment_id": "l14rj1o",
                "author": "Abrushing",
                "datetime": 1714006213.0,
                "text": "I can buy a lot of other cool shit for $3k. If this had been have the price I MAYBE would have thought about it"
            },
            {
                "comment_id": "l15848h",
                "author": "ponderousponderosas",
                "datetime": 1714012690.0,
                "text": "Ill buy it for three fiddy."
            },
            {
                "comment_id": "l18z1zq",
                "author": "Vamproar",
                "datetime": 1714076576.0,
                "text": "The \"future\" lol.\n\nNo one wants to walk around wearing giant goggles..."
            },
            {
                "comment_id": "l19oi3q",
                "author": "rnike879",
                "datetime": 1714086069.0,
                "text": "Under delivered on their promises, way overpriced, and is comparable to a far, far cheaper quest 3. I guess the apple folks don't have enough kidneys left to sell for this gadget"
            },
            {
                "comment_id": "l10n7is",
                "author": "The_real_bandito",
                "datetime": 1713948199.0,
                "text": "I just hope this doesn't become shovelware. They do have a nice product, it just needs time."
            },
            {
                "comment_id": "l117bzc",
                "author": "shinra528",
                "datetime": 1713960625.0,
                "text": "This isn’t so different from the first iPad or Apple Watch. If Apple can find their killer app for it and/or bring the price down, Gen 2 will see more success."
            },
            {
                "comment_id": "l10i7b1",
                "author": "TokyoOldMan",
                "datetime": 1713944368.0,
                "text": "Apples products last a few years before they’re replaced by the next model, and the older versions simply become unusable due software  being removed from the AppStore.  So 4000 US$ is just asking way too much."
            },
            {
                "comment_id": "l116ahf",
                "author": "Responsible-Room-645",
                "datetime": 1713960137.0,
                "text": "I really really really want these. I really really really can’t afford them."
            },
            {
                "comment_id": "l11gt8j",
                "author": "SuperpositionSavvy",
                "datetime": 1713964672.0,
                "text": "Imagine that, a $3500 piece of unnecessary tech isn't selling well during a time when many people are struggling to pay rent and buy groceries"
            },
            {
                "comment_id": "l11o5bj",
                "author": "BeskarHunter",
                "datetime": 1713967455.0,
                "text": "I have a few VR headsets. This is the only one I actively use daily. Getting to watch every movie in Dolby Cinema quality is the killer app for me. I always disliked 3D because it made the picture darker and I already wear glasses. But the 3D with the AVP is amazing and makes me enjoy the format. \n\nThe thing is a couple months old and developers barely got their hands on it. Why would people be flocking to it to begin with? Apple could barely get Sony to make 900k micro oled screens. So this headset is already limited to around 400k its first year. \n\nBut people make it sound like there are millions of unsold models sitting on the shelves, cementing it flopped? That math doesn’t add up. \n\nOf course there isn’t a killer app, the developers have barely started developing for it. If a new product isn’t immediately supported by every person it’s all of a sudden a Failure?\n\nI for one enjoy watching this tech evolve, but it’s not gonna catch on over night obviously. Or was each headset being $4 grand not make that obvious?"
            },
            {
                "comment_id": "l1245e9",
                "author": "UniverseBear",
                "datetime": 1713973015.0,
                "text": "Apple doesn't realize I'm already trying to augment my reality by saving money."
            },
            {
                "comment_id": "l13nxhv",
                "author": "yougotthismofo",
                "datetime": 1713991446.0,
                "text": "It’s neat to see these shitbags get told no."
            },
            {
                "comment_id": "l13uhfe",
                "author": "thisfilmkid",
                "datetime": 1713993643.0,
                "text": "Please, please release the report for: how many Vision Pros sold, returned, and sent in for report. \n\nOf course, they will not release such info. Wishful thinking."
            },
            {
                "comment_id": "l10lzbn",
                "author": "echolalia_",
                "datetime": 1713947252.0,
                "text": "I have a pair and I really enjoy them. Great for movies and a game changer for traveling. It’s also nice if I’m doing something where I need a bunch of windows open at once. Apple are seriously dropping the ball on content though…there were a few shows released at the beginning filmed in immersive video and it’s really cool…but they all have “episode 1” and then just never released an episode 2. Third party app support is pretty sparse too. Feels like a lot of potential but no killer app taking advantage of it yet."
            },
            {
                "comment_id": "l10z0r3",
                "author": "mysticalfruit",
                "datetime": 1713956364.0,
                "text": "It's really cool tech.\n\nIf you live near an Apple store, go schedule a 30 minute demo. If artists *right* now aren't embracing immersion, they're going to get left in the dust.\n\nIt's bonkers cool.. but clearly version .1 of this tech and way too expensive for what it can do *for now*."
            }
        ]
    },
    {
        "post_id": "1cbawhb",
        "title": "Apple Cuts Vision Pro Shipments As Demand Falls 'Sharply Beyond Expectations'",
        "url": "https://www.macrumors.com/2024/04/23/apple-cuts-vision-pro-shipments/",
        "score": 5824,
        "upvotes": 5824,
        "downvotes": 0,
        "num_comments": 1418,
        "text": "",
        "author": "BlueLightStruct",
        "author_post_karma": 46971,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l0x6z5k",
                "author": "sexydentist00",
                "datetime": 1713894764.0,
                "text": "You’re telling me customers aren’t lining up to buy a $3,500 Apple luxury toy that has limited use for most consumers during a time of high inflation? I am shocked!"
            },
            {
                "comment_id": "l0xb3l8",
                "author": "traffic-robot",
                "datetime": 1713896139.0,
                "text": "I’m not buying an obvious prototype and volunteering to be a beta tester."
            },
            {
                "comment_id": "l0yndhx",
                "author": "BalmyPalms",
                "datetime": 1713912685.0,
                "text": "No average person is giving a fuck about this kind of technology until it fits like a pair of sunglasses."
            },
            {
                "comment_id": "l0x7rmg",
                "author": "Mizghetti",
                "datetime": 1713895025.0,
                "text": "Ready player none"
            },
            {
                "comment_id": "l0xbba0",
                "author": "obsertaries",
                "datetime": 1713896212.0,
                "text": "They must have had some fucked up expectations."
            },
            {
                "comment_id": "l0x81b5",
                "author": "SnowyLynxen",
                "datetime": 1713895114.0,
                "text": "When can I find them in the bargain bin at Walmart apple?"
            },
            {
                "comment_id": "l0xah89",
                "author": "WriterNotFamous",
                "datetime": 1713895931.0,
                "text": "$3500 toy that you told everyone it won't be what you want it to be until generation 4. There was not one app or feature they showed that made me want to buy."
            },
            {
                "comment_id": "l0zckoe",
                "author": "Alive_Ad_5931",
                "datetime": 1713922521.0,
                "text": "Majority of the population can’t afford rent.\n\nApple: “Why can’t people buy our overpriced toy that was last to market!”"
            },
            {
                "comment_id": "l0xbqoz",
                "author": "taix8664",
                "datetime": 1713896357.0,
                "text": "How many 3500$ dork helmets with no apps did they expect to sell exactly?"
            },
            {
                "comment_id": "l0xdoho",
                "author": "tacticalcraptical",
                "datetime": 1713897006.0,
                "text": "As someone who has been a VR enthusiast, I feel like I knew it would go like this.\n\nAlmost everyone who I have had at my place to try my headset thinks it's cool but not something they'd probably spend the time or money on... and that was even before someone was trying to sell a $3,500 headset.\n\nIt's niche and it's going to be that way until they get a lot smaller and have a more practical use case for the majority of people."
            },
            {
                "comment_id": "l0xuk5e",
                "author": "Serenity867",
                "datetime": 1713902614.0,
                "text": "Apple treats third-party developers like shit for 15 years, doesn't release any of their own groundbreaking apps for the vision pro, and then has a shocked pikachu face when developers don't want to make apps for a super niche market. That's what was required to actually make a product like the vision pro worth using for the vast majority of end-users, and now those users are losing interest.\n\nMasterful gambit Apple.\n\nEdited to add: I'm a third-party developer, I own some version of all of their recently released products except for the vision pro (MBP, iPad, iPhone, airpods, watch) for either development or personal use, and I can definitely say they did a terrible job laying the groundwork for the vision pro product launch."
            },
            {
                "comment_id": "l0zcjrj",
                "author": "bryankerr",
                "datetime": 1713922510.0,
                "text": "Look at the spin on that wordplay 'sharply beyond expectations'.\n\nLet me fix that to 'sharply below expectations '"
            },
            {
                "comment_id": "l0xab86",
                "author": "Iyellkhan",
                "datetime": 1713895876.0,
                "text": "it shouldnt surprise tech companies that not many people want to pay $3500 for a thing they have to strap to their heads to use. Heck, not many people will pay $500 for that."
            },
            {
                "comment_id": "l0xfh56",
                "author": "Lofteed",
                "datetime": 1713897610.0,
                "text": "that video of that dude driving a cybertruck while wearing apple goggles is truly the synthesis of this era\n\nthe detachment from real costumers needs is absolute"
            },
            {
                "comment_id": "l0xuwr9",
                "author": "Mega_Moltres",
                "datetime": 1713902731.0,
                "text": "ZE GOOGLES ZEY DO NOTHING!"
            },
            {
                "comment_id": "l0xbrxg",
                "author": "eri-",
                "datetime": 1713896368.0,
                "text": "Theyve been banking on the whole apple cult-like following thing a bit too much over the past few years."
            },
            {
                "comment_id": "l0x8wnf",
                "author": "Tumblrrito",
                "datetime": 1713895402.0,
                "text": "It’s an extremely impressive device that is literally weighed down by strange design decisions. How is this going to replace my laptop if I can’t stand wearing it for longer than an hour?"
            },
            {
                "comment_id": "l0y1vcr",
                "author": "rcanhestro",
                "datetime": 1713905011.0,
                "text": "no shit, VR is a niche market already, and this costs 7x more than his primary competition (Meta Quest 3).\n\nalso, from what i understand, if you're not in the \"Apple Ecosystem\" already, you lose a lot of features as well, so the potential buyer pool shrinks even more."
            },
            {
                "comment_id": "l0zmfyz",
                "author": "functional_grade",
                "datetime": 1713926455.0,
                "text": "Huh? People aren't buying overpriced virtual boy for the what, fourth time someone tried it? Wowww"
            },
            {
                "comment_id": "l0xnuhq",
                "author": "FreshPrinceOfH",
                "datetime": 1713900399.0,
                "text": "I’m guessing Vision Pro probably sold more meta headsets than Apple headsets."
            },
            {
                "comment_id": "l0xcuvr",
                "author": "degenerate_hedonbot",
                "datetime": 1713896731.0,
                "text": "I think Apple’s monopolistic practices (taking ~30% cut on in-app purchases) in their App Store plays a huge role in developers not wanting to make apps for the latest Apple devices. \n\nNetflix, Spotify, etc. are all not available for the Vision Pro.\n\nI develop apps so I am a bit biased but its frustrating seeing Apple trying to circumvent laws in bad faith (there was a new anti-monopolistic European law that Apple circumvented in bad faith).\n\nIts sort of schadenfreude for Apple’s latest and greatest Vision Pro to suffer from lack of adoption and hopefully that will be a humbling experience for them.\n\nThey need app developers to succeed."
            },
            {
                "comment_id": "l0xcag5",
                "author": "Un_Original_Coroner",
                "datetime": 1713896541.0,
                "text": "I can’t comprehend how such a successful company could be this disconnected. I am absolutely the target audience for this device (outside of Apple fans who’d just buy anything at all) and it didn’t even cross my mind after the price appeared on screen.\n\nWho did they think would be lining up to buy this niche product in large enough numbers for it to be profitable? \n\nI hope someone smarter than me does a case study on this in a decade."
            },
            {
                "comment_id": "l0yg2p7",
                "author": "ngwoo",
                "datetime": 1713909956.0,
                "text": "This is what happens when you release a $3500 piece of hardware for a market that hasn't had a compelling piece of software since Half Life Alyx 4 years ago. VR is dead. Nobody wants to isolate themselves from the world with an uncomfortable piece of plastic full of half-assed apps."
            },
            {
                "comment_id": "l0yfft7",
                "author": "TanguayX",
                "datetime": 1713909722.0,
                "text": "I love Mac stuff. \nI’ve played with the Vision Pro.\nI found the Vision Pro to be incredibly neat.\nI make a decent living.\nThere is no world I would pay $3500 for the Vision Pro. \n\nThere ya go."
            },
            {
                "comment_id": "l0zj0s2",
                "author": "Tim-in-CA",
                "datetime": 1713925049.0,
                "text": "This needed to be $999 at most.  Current price is outrageous"
            },
            {
                "comment_id": "l0xbe98",
                "author": "CrzyWrldOfArthurRead",
                "datetime": 1713896240.0,
                "text": "yet another company disappointed to learn that people dont' what to wear shit on their face unless they have to"
            },
            {
                "comment_id": "l0xkdij",
                "author": "sbrooks84",
                "datetime": 1713899253.0,
                "text": "I am pretty sure my Dad is one of the few who has just been so very happy with his headset. He has been playing around with the OS to develop the tools he wants to make and treats it like a full time job in his retirement. I saw some of the Masters content on the Vision Pro app and wow, it was incredible to see what it can do"
            },
            {
                "comment_id": "l0y38fc",
                "author": "jamiestar9",
                "datetime": 1713905469.0,
                "text": "Falls sharply ~~beyond~~ **below** expectations."
            },
            {
                "comment_id": "l0zlc5x",
                "author": "Whatwhyreally",
                "datetime": 1713925996.0,
                "text": "It’s not even that demand is falling. It’s that it’s not a product category 99% of people have interest in at ANY price. So really, demand don’t fall. It’s just that the 1% of people who are willing to buy it already have. Lol."
            },
            {
                "comment_id": "l10evjn",
                "author": "Dandanthebikerman",
                "datetime": 1713941922.0,
                "text": "It’s too expensive"
            },
            {
                "comment_id": "l0xdnfw",
                "author": "xantub",
                "datetime": 1713896997.0,
                "text": "I wonder how many of their \"shipped\" units were sent free to influencers so they could show it the week it was launched."
            },
            {
                "comment_id": "l0xl9wx",
                "author": "TentacleJesus",
                "datetime": 1713899551.0,
                "text": "Man they must be really detached if they thought this thing was going to be a hit."
            },
            {
                "comment_id": "l0xp7e8",
                "author": "stapango",
                "datetime": 1713900843.0,
                "text": "Have a strong feeling this is going to be looked back on as Apple's 'virtual boy' moment, where (obscene price tag aside) the company forgot to notice that the downsides of using the product outweigh the upsides.\n\nLet's see if I'm wrong, though..\n\n!remindme 10 years"
            },
            {
                "comment_id": "l0zdfhd",
                "author": "LeBB2KK",
                "datetime": 1713922856.0,
                "text": "I’d gladly buy one, just not at these prices…"
            },
            {
                "comment_id": "l10ig26",
                "author": "Aeroncastle",
                "datetime": 1713944550.0,
                "text": "It's a 90hertz shitty VR headset, what did they expect?"
            },
            {
                "comment_id": "l10kqno",
                "author": "BlackReddition",
                "datetime": 1713946303.0,
                "text": "So surprised, it's closer to $6k in Australia, so it's never going to get traction."
            },
            {
                "comment_id": "l113jil",
                "author": "CurrentlyLucid",
                "datetime": 1713958803.0,
                "text": "Hard to believe nobody really needs a 3500 dollar toy."
            },
            {
                "comment_id": "l0xfjtj",
                "author": "PlowMeHardSir",
                "datetime": 1713897635.0,
                "text": "People don’t want to pay $3,500 for an Apple VR headset when they can get most of the functionality from a $500 Meta Quest VR headset. And both units are glorified technology demos with no killer app."
            },
            {
                "comment_id": "l0xodh3",
                "author": "perthguppy",
                "datetime": 1713900570.0,
                "text": "I’m m confused why they took this move instead of just releasing the product outside of the US?"
            },
            {
                "comment_id": "l0xs4mb",
                "author": "defaultgameer1",
                "datetime": 1713901805.0,
                "text": "When you want an example of company leadership being completely unaware of a. The customers b. The economy c. How to justify a product.\n\nCompletely out of touch with reality, and drinking their own kool aid that anything they make is just the best, and customers want to hand over every spare buck."
            },
            {
                "comment_id": "l0xtrtu",
                "author": "Minute-Solution5217",
                "datetime": 1713902354.0,
                "text": "There is a very small market for 3500$ US only 1st generation product that can't do more than your phone"
            },
            {
                "comment_id": "l0xzvtn",
                "author": "itzmoepi",
                "datetime": 1713904349.0,
                "text": "Yeah, the average consumer is not going to buy a $3500 headset. Try again when it's around $1k price range."
            },
            {
                "comment_id": "l0y1k0q",
                "author": "strifejester",
                "datetime": 1713904906.0,
                "text": "Maybe because the price is sharply beyond budgets."
            },
            {
                "comment_id": "l0y37r2",
                "author": "foundafreeusername",
                "datetime": 1713905463.0,
                "text": "Did they expect to sell 800k in the US only? That sounds like a very high expectation. Also weird they reduced production before even opening the sale for other countries. \n\nI still plan to purchase one to port my software to vision pro but I am worried that by the time I get to it everyone got bored of this thing"
            },
            {
                "comment_id": "l0y6z7y",
                "author": "Itsatinyplanet",
                "datetime": 1713906733.0,
                "text": "It's Apple's Cybertruck"
            },
            {
                "comment_id": "l0y7l0x",
                "author": "brokedownpalace11",
                "datetime": 1713906938.0,
                "text": "Too bulky and too pricey. No brainer."
            },
            {
                "comment_id": "l0yktjc",
                "author": "RyghtHandMan",
                "datetime": 1713911709.0,
                "text": "Falls Beyond? Let me talk to your editor"
            },
            {
                "comment_id": "l0ymef3",
                "author": "Human_Software_1476",
                "datetime": 1713912313.0,
                "text": "Shits a novelty"
            },
            {
                "comment_id": "l0zm7p5",
                "author": "scrooplynooples",
                "datetime": 1713926361.0,
                "text": "Could have probably seen this one coming if they didn’t have VR headsets on"
            },
            {
                "comment_id": "l0zpf2d",
                "author": "yetagainitry",
                "datetime": 1713927702.0,
                "text": "People want to just play around with vr for like an hour. They don’t want to make it part of their everyday life."
            },
            {
                "comment_id": "l0zqpqx",
                "author": "Total_Package_6315",
                "datetime": 1713928279.0,
                "text": "If Jobs was still alive he would have likely demanded they get the price down to the same as an iphone or don't release it until you can. Who the hell has $3500 to drop on a novelty device.  Its brilliant tech and I'd love to have one although there is no need for such a device.  Also, its too damn expensive for the masses and the 1%  buying these aint enough to boost sales. Apple has damn near $200 billion in cash reserves. They should have bought their Apple Vision Pro inventory  to reduce the price then resold it for no more than $1500 , hahaha"
            },
            {
                "comment_id": "l0zrohf",
                "author": "Im_not_crying_u_ar",
                "datetime": 1713928711.0,
                "text": "Yea they really missed the mark with this one. They would have been better off taking a loss on each unit to gain market share like oculus did"
            },
            {
                "comment_id": "l0zrtmy",
                "author": "Total_Package_6315",
                "datetime": 1713928777.0,
                "text": "I have literally heard nothing about the Vision Pro since launch. Apple clearly isn't doing any advertising for it at all. Perhaps they should lower the price although I bet they would rather dump them in a land fill than do that."
            },
            {
                "comment_id": "l109pbv",
                "author": "Ashallond",
                "datetime": 1713938397.0,
                "text": "I mean, the groans at the launch event didn’t warn them this was going to happen?\n\nTalk about having your blinders on…."
            },
            {
                "comment_id": "l10a6y0",
                "author": "SkyJohn",
                "datetime": 1713938720.0,
                "text": "Well duh, nobody asked for a $3500 VR iPad."
            },
            {
                "comment_id": "l10av56",
                "author": "DankHillington",
                "datetime": 1713939168.0,
                "text": "It’s almost like the average consumer can’t afford a $3500 VR headset that can’t even play VR games."
            },
            {
                "comment_id": "l10b5li",
                "author": "gpister",
                "datetime": 1713939362.0,
                "text": "I am surprised isheep didnt eat all this up this huge scam."
            },
            {
                "comment_id": "l10h0zf",
                "author": "subcide",
                "datetime": 1713943480.0,
                "text": "In line with my expectations. Hire me Apple."
            },
            {
                "comment_id": "l10mew1",
                "author": "snaap224",
                "datetime": 1713947587.0,
                "text": "Watching reviewers and especially apple users testing it, and saying after that they look forward to the next version with features software updates could provide was mind-blowing.\n\nIt just tells you how much these people were brainwashed by the company into thinking a product cant be updated once it has been released.\n\nA VR headset itself is already a niche product, add apple exclusivity into it, it gets even more niche, tripple or quadruple the price and its obviously a product for the most hardcore fans, rich ones tbf.\n\nLooking back now, and seeing all those alleged people using it in public, it must have been all apple employers or influencers right?"
            },
            {
                "comment_id": "l10q56l",
                "author": "Challenging_Entropy",
                "datetime": 1713950424.0,
                "text": "hey Apple! Apple hey! Hey-hey Apple!\n\nI’ll buy one off yall for $600"
            },
            {
                "comment_id": "l10s988",
                "author": "--ikindahatereddit--",
                "datetime": 1713951994.0,
                "text": "Apple, just because you keep making random shit doesn’t mean people can actually afford it, or even want to"
            },
            {
                "comment_id": "l10u779",
                "author": "letthetreeburn",
                "datetime": 1713953358.0,
                "text": "Why isn’t it a gaming VR headset with the best graphics on the market? There’s tons of VR games out there, all they had to do was make this the cleanest display headset you’d ever see and they’d corner the oculus rift market. Why isn’t it a gaming headset?"
            },
            {
                "comment_id": "l10v2r0",
                "author": "Spuckuk",
                "datetime": 1713953939.0,
                "text": "Who could have seen this except everyone"
            },
            {
                "comment_id": "l111s7e",
                "author": "Wesbubbles",
                "datetime": 1713957895.0,
                "text": "Launching a VR system a few years after the hype dies down for double the price, what could go wrong!?!"
            },
            {
                "comment_id": "l117rt6",
                "author": "IHate2ChooseUserName",
                "datetime": 1713960827.0,
                "text": "i have a solution, sell it for $350"
            },
            {
                "comment_id": "l11gf6u",
                "author": "yahboioioioi",
                "datetime": 1713964519.0,
                "text": "The price is too damn high"
            },
            {
                "comment_id": "l12bzir",
                "author": "Agreeable_Class_6308",
                "datetime": 1713975639.0,
                "text": "If they had actually tried to price this at an “ affordable” level on par with an iPad or a Macbook Air this would’ve sold tremendously well. Instead they went the luxury route thinking nobody would care. \n\nApple has gotten greedy. Say what you want about Steve but he would’ve never let this thing exceed $1,500"
            },
            {
                "comment_id": "l12cjwg",
                "author": "AuroraBorrelioosi",
                "datetime": 1713975827.0,
                "text": "I have a feeling that VR and AR will never be a mainstream product under the current silicon-based computer architecture we have now. I'm no engineer, but I highly doubt that enough processing power can ever be shrunk into the space and weight of normal glasses without running into limitations set by quantum mechanics. And most normal people will not want to wear anything bigger or heavier than glasses on their face, ever."
            },
            {
                "comment_id": "l0xafed",
                "author": "who_oo",
                "datetime": 1713895914.0,
                "text": "First the autonomous car than this.. Last time I said the CEO should take responsibility I was bashed by CEO worshiping rabid dogs.. is it different this time ?"
            },
            {
                "comment_id": "l0xcyr2",
                "author": "tifauk",
                "datetime": 1713896766.0,
                "text": "Because not everyone wants to look like they're going on a ski-ing holiday in spring...\n\nI agree the thing probably has a practical use, but jeez the thought of wearing that in public makes me cringe"
            },
            {
                "comment_id": "l0xgyx3",
                "author": "ogpterodactyl",
                "datetime": 1713898113.0,
                "text": "The technology just isn’t there for Vr yet. We need more computing power for cheaper before it’s ready to take off.  Because of this no one bothers making good games or software programs for such a limited number of prospective users."
            },
            {
                "comment_id": "l0xoq83",
                "author": "Ok_Minimum6419",
                "datetime": 1713900686.0,
                "text": "The truth is unless VR is as light and easy to use as putting on a pair of eyeglasses, no one is gonna want it."
            },
            {
                "comment_id": "l0xqrgp",
                "author": "dinominant",
                "datetime": 1713901357.0,
                "text": "A locked platform will negatively impact demand."
            },
            {
                "comment_id": "l0xxzvj",
                "author": "action_turtle",
                "datetime": 1713903742.0,
                "text": "Like the PSVR, just give in an allow PC gaming on it. You open up a big market and that encourages devs to build for it, which encourages more buyers"
            },
            {
                "comment_id": "l0y1yv8",
                "author": "Mizfitt77",
                "datetime": 1713905043.0,
                "text": "It was *never* a good product when the best VR needs the ability to install shit that isn't on the Apple store.  That immediately makes it pointless trash."
            },
            {
                "comment_id": "l0y39oz",
                "author": "Overall_Strawberry70",
                "datetime": 1713905481.0,
                "text": "How did they ever expect this to compete with the quest 3 which is like 1/6 the price? did they think people would just buy it because its apple?"
            },
            {
                "comment_id": "l0y3x14",
                "author": "Jax_the_Floof",
                "datetime": 1713905699.0,
                "text": "Whoa! Who could have predicted that an ugly $3500 vr headset that doesn’t even play games would nit be that successful??"
            },
            {
                "comment_id": "l0ya6vh",
                "author": "flyingdorito2000",
                "datetime": 1713907844.0,
                "text": "Fire whoever was in charge of sales expectations"
            },
            {
                "comment_id": "l0yb6c9",
                "author": "CoverYourMaskHoles",
                "datetime": 1713908196.0,
                "text": "Come on Apple… it’s 3,500, most people can’t afford to pay their credit cards off…"
            },
            {
                "comment_id": "l0ycb1s",
                "author": "Desperate-Papaya-476",
                "datetime": 1713908597.0,
                "text": "That’s grocery and bill money now. Apple will be lucky to get $300 for one."
            },
            {
                "comment_id": "l0yerc5",
                "author": "tissboom",
                "datetime": 1713909474.0,
                "text": "I might’ve bought one for $1000. $3500… Come on even for you guys Apple that’s out of fucking control."
            },
            {
                "comment_id": "l0yf7fj",
                "author": "thesourpop",
                "datetime": 1713909635.0,
                "text": "\"Guys don't worry this is Apple's flagship pro model, they obviously don't expect the everyman to buy it for $3500\"\n\n\"Wait! Why aren't you all buying the $3500 headset??\""
            },
            {
                "comment_id": "l0ygi1q",
                "author": "NonProphet8theist",
                "datetime": 1713910111.0,
                "text": "Hmm, maybe because it looks ridiculous lol"
            },
            {
                "comment_id": "l0yi2ed",
                "author": "notsomagicman",
                "datetime": 1713910684.0,
                "text": "I bet the people who shelled out thousands of dollars have it on a shelf or desk collecting dust. \n\nAnyone who owns a VR headset saw this coming a mile away. A mind blowing first experience that pretty quickly fades into \"I just can't be bothered\""
            },
            {
                "comment_id": "l0yi3sg",
                "author": "MarkusRight",
                "datetime": 1713910698.0,
                "text": "It doesn't even have its killer app. Why would you release a product with the bare minimum apps and games that other much cheaper headset ready have. The quest 3 for example has some of the best games and passthrough games I have ever seen. Apple has Jack shit and no controllers to allow you to properly play or interact with the apps and games. To me its just a far far worse version of the quest 3 in every way that costs 5x as much. What even is the appeal?"
            },
            {
                "comment_id": "l0yid7a",
                "author": "TherealslimJeff",
                "datetime": 1713910794.0,
                "text": "It doesn’t really have many practical applications at the moment, so it’s really hard to justify spending $3500 on a novelty."
            },
            {
                "comment_id": "l0yinz1",
                "author": "EmperorGrinnar",
                "datetime": 1713910905.0,
                "text": "Turns out that people don't want to spend that much money on something with false promises and less functionality than an Oculus."
            },
            {
                "comment_id": "l0ykind",
                "author": "Vo_Mimbre",
                "datetime": 1713911594.0,
                "text": "I wish it actually solve core VR problems.\n\nNice headset is still too big and clunky. Even if they slashed the price to Quest 3 levels and took a bath on profit/loss, it still couldn’t sell enough to change the world.\n\nThese devices need to be off the face. \n\nOr we need a pandemic virus that spreads by looking at people that creates a market that requires we wear these."
            },
            {
                "comment_id": "l0yljyd",
                "author": "brova",
                "datetime": 1713911989.0,
                "text": "who the fuck would buy this beyond rich douchebags and influencers?"
            },
            {
                "comment_id": "l0ylvit",
                "author": "I_Am_A_Pumpkin",
                "datetime": 1713912113.0,
                "text": "it has no games and no porn, what did they expect?"
            },
            {
                "comment_id": "l0z191y",
                "author": "Jorgen_Pakieto",
                "datetime": 1713918113.0,
                "text": "I would’ve got one if it wasn’t priced so highly."
            },
            {
                "comment_id": "l0z61sa",
                "author": "chicano32",
                "datetime": 1713919988.0,
                "text": "If they made it look like virtual boy and priced it at 1,000, it would be flying off the shelfs"
            },
            {
                "comment_id": "l0z9fuq",
                "author": "zyx1989",
                "datetime": 1713921312.0,
                "text": "I find the product, interesting, the look, appealing, but the price, mmm, I will get a full set of HTC plus pc upgrade over vision pro any day of the week"
            },
            {
                "comment_id": "l0z9rsa",
                "author": "eulynn34",
                "datetime": 1713921441.0,
                "text": "Weird that people aren't flocking to blow 4 grand on a toy with no practical use\n\nI wonder why Apple thought they were going to sell millions of these? To who?"
            },
            {
                "comment_id": "l0zbxez",
                "author": "jfmherokiller",
                "datetime": 1713922275.0,
                "text": "apple forgot that vr on its own is a a niche thing that the general public just thinks of as a cool toy. Not an actual investment"
            },
            {
                "comment_id": "l0zcfgi",
                "author": "albeva",
                "datetime": 1713922464.0,
                "text": "When we get 2nd gen device at maybe £1000 I might be interested. Right now? No way."
            },
            {
                "comment_id": "l0zd4t9",
                "author": "TheJoshuaJacksonFive",
                "datetime": 1713922739.0,
                "text": "When they roll fitness into it, I’ll actually think about it. Until then, my $400 quest 3 is perfect."
            },
            {
                "comment_id": "l0zi1xm",
                "author": "okaquauseless",
                "datetime": 1713924665.0,
                "text": "I really don't recall when early adopter tech was a behemoth landline in your pocket when it came to smartphones nor a clock tower on your wrist for smart watches. \n\nWe all know what form factor and use case wearable smart tech need to achieve to be valuable, so give us something matching the form before the use"
            },
            {
                "comment_id": "l0zm717",
                "author": "FlappyEmu",
                "datetime": 1713926353.0,
                "text": "People are trying to stay alive and not get behind rent or car payments. Probably less of a priority to cos-play as the chair bound society on Wall-E’s ship."
            },
            {
                "comment_id": "l0zomv0",
                "author": "WhatTheZuck420",
                "datetime": 1713927364.0,
                "text": "They’re not selling beyond my wildest imagination"
            },
            {
                "comment_id": "l0zqnma",
                "author": "eveningsand",
                "datetime": 1713928252.0,
                "text": "I had forgotten these were a thing until someone from Apple reminded me about them a week ago."
            },
            {
                "comment_id": "l0zuokm",
                "author": "Moonlitnight",
                "datetime": 1713930102.0,
                "text": "I have a great idea!!! Let’s layoff a bunch of tech workers - ya know, a key demographic in helping this technology take off - and make the future for those we let stay so unstable they’ll hoard any disposable income for fear of the next layoff round. And then price it at $3500!!"
            },
            {
                "comment_id": "l0zuyux",
                "author": "Frostsorrow",
                "datetime": 1713930239.0,
                "text": "Who could have guessed a $3500 extremely niche product wouldn't sell well?"
            },
            {
                "comment_id": "l0zw539",
                "author": "madunne",
                "datetime": 1713930812.0,
                "text": "Nobody want that Bs"
            },
            {
                "comment_id": "l0zxvrf",
                "author": "Retro-Koala4886",
                "datetime": 1713931683.0,
                "text": "Price aside, I can't even imagine wanting these. A smartphone strapped to my eyes?!?!"
            },
            {
                "comment_id": "l0zyomg",
                "author": "TheB1GLebowski",
                "datetime": 1713932087.0,
                "text": "I wonder if the dude who wore these to his wedding will look back one day and realize how fucking stupid he is? "
            },
            {
                "comment_id": "l106vib",
                "author": "DaveModer",
                "datetime": 1713936622.0,
                "text": "I was wandering why Apple is pushing this narrative that companies will pick this up. I work at a large multinational company in the IT department and we have engineers and never ever any of them asked for any kind of VR headset. They always ask for more pooowerrr and large monitors. So we buy them workstations with Quadro cards and ultra wide monitors 😏 in my opinion VR is just a gimmick for companies."
            },
            {
                "comment_id": "l107865",
                "author": "BaguioBaggins",
                "datetime": 1713936837.0,
                "text": "They thought it would sell like an IPhone."
            },
            {
                "comment_id": "l10ci7v",
                "author": "Bezos_Balls",
                "datetime": 1713940271.0,
                "text": "My friend has one and I’m pretty confident the only thing he uses it for is watching Netflix in bed and jacking off. He also loves to show it to all his friends."
            },
            {
                "comment_id": "l10eugk",
                "author": "UloPe",
                "datetime": 1713941901.0,
                "text": "I would totally get one if it was iPad priced, but at 3500? No chance…"
            },
            {
                "comment_id": "l10i2dl",
                "author": "IamCaptainHandsome",
                "datetime": 1713944265.0,
                "text": "Hardly surprising, the die hard Apple fans were always going to buy it on release, but at that price point nobody else was going to."
            },
            {
                "comment_id": "l10j12e",
                "author": "Abject-Dentist-1950",
                "datetime": 1713944992.0,
                "text": "Apple was really trying to pretend 90% of VR use case aren't adults pretending to be furries or underage lesbian anime girls in VRChat and this reflects in the sales."
            },
            {
                "comment_id": "l10lc3u",
                "author": "Capital_Werewolf_788",
                "datetime": 1713946753.0,
                "text": "Apple will probably somehow reduce the size of the vision pro by 75% and make it wireless in the next couple of years. I’ll buy it then, not this chunky prototype which is admittedly still really cool."
            },
            {
                "comment_id": "l10lz8p",
                "author": "Sa404",
                "datetime": 1713947250.0,
                "text": "It’s too expensive and much of a burden/limited for anyone to replace their computer, it may at most be a TV replacement"
            },
            {
                "comment_id": "l10q7fn",
                "author": "GeekFurious",
                "datetime": 1713950471.0,
                "text": "What's a Vision Pro?"
            },
            {
                "comment_id": "l10tfhs",
                "author": "RMDashRFCommit",
                "datetime": 1713952829.0,
                "text": "It’s a stupid clumsy product. \n\nThis is repackaged tech with some software additions. Virtual/Augmented Reality will never catch on until the form factor is that of normal glasses."
            },
            {
                "comment_id": "l10v9zi",
                "author": "Beguil3r",
                "datetime": 1713954071.0,
                "text": "Who would have thought that rich CEOs are out of touch huh…"
            },
            {
                "comment_id": "l10vajp",
                "author": "thackstonns",
                "datetime": 1713954081.0,
                "text": "Because VR and AR is stupid.  Normal people aren’t going to use it.  AR might take off if they ever solve the wearability and computer power problems.  \nBut I’ll never put on a headset to watch a movie when my phone is right there and I’ve already paid for it.\nIt’s the 3d tv of the 2000’s.  It’s a gimmick."
            },
            {
                "comment_id": "l10y4v1",
                "author": "Reddit4Deddit",
                "datetime": 1713955845.0,
                "text": "I've not heard a single thing about this headset since the return period ended lol"
            },
            {
                "comment_id": "l110g0n",
                "author": "ComfortablyNomNom",
                "datetime": 1713957174.0,
                "text": "VR headsets are just not the future of entertainment that some people seem to think they are. Consumers don't want them."
            },
            {
                "comment_id": "l112olr",
                "author": "ASquawkingTurtle",
                "datetime": 1713958366.0,
                "text": "I wish tech companies would stop trying to make vr/ar a thing"
            },
            {
                "comment_id": "l115u2l",
                "author": "Puzzled_Path_8672",
                "datetime": 1713959919.0,
                "text": "Not strapping $3500 glasses to my face unless they look like my regular glasses with apple pro levels of performance.\n\nI dream."
            },
            {
                "comment_id": "l116npq",
                "author": "Stoke-me-a-clipper",
                "datetime": 1713960313.0,
                "text": "I was lining up to buy it but then realized I don't have an extra $3,500 burning a hole in my pocket"
            },
            {
                "comment_id": "l1176wn",
                "author": "jackass_of_all_trade",
                "datetime": 1713960560.0,
                "text": "Apple got too cocky"
            },
            {
                "comment_id": "l118jjp",
                "author": "RS3550",
                "datetime": 1713961175.0,
                "text": "Oh no! Anyway....."
            },
            {
                "comment_id": "l118xmu",
                "author": "dkny212",
                "datetime": 1713961350.0,
                "text": "Was demand ever there?"
            },
            {
                "comment_id": "l1194ii",
                "author": "Turbos_Bitch",
                "datetime": 1713961434.0,
                "text": "I’ll try one when they are around $1000.  Not paying $3500"
            },
            {
                "comment_id": "l119bc0",
                "author": "itspurpleglitter",
                "datetime": 1713961518.0,
                "text": "I’m surprised there was any demand to begin with."
            },
            {
                "comment_id": "l11a0re",
                "author": "AncientHawaiianTito",
                "datetime": 1713961830.0,
                "text": "File this one under “Lacking self awareness”"
            },
            {
                "comment_id": "l11b6h3",
                "author": "CellistAvailable3625",
                "datetime": 1713962344.0,
                "text": "$3500 is not a good price for this product"
            },
            {
                "comment_id": "l11fgh3",
                "author": "iamtehryan",
                "datetime": 1713964133.0,
                "text": "Did Apple honestly and truly expect this product to be one that people wanted to actually buy outside of YouTube reviewers and the like? Like, they couldn't have actually thought that loads of people would want to drop $3500 on a very limited, bulky and dumb looking headset, right?"
            },
            {
                "comment_id": "l11gmnj",
                "author": "ClearlyUnderstood69",
                "datetime": 1713964601.0,
                "text": "No shit?"
            },
            {
                "comment_id": "l11ie15",
                "author": "FobuckOboff",
                "datetime": 1713965287.0,
                "text": "I mean, I’m trying to afford groceries."
            },
            {
                "comment_id": "l11rcjm",
                "author": "SimplyNotPho",
                "datetime": 1713968609.0,
                "text": "Lowering the price would probably help with the demand issue"
            },
            {
                "comment_id": "l1245vy",
                "author": "JohrDinh",
                "datetime": 1713973020.0,
                "text": "People seem to be edging away from tech more and more, realizing it's pretty bad for social interaction, eye sight, attention, etc...strapping this to your head seems like a fairly out of touch product decision imo. Outside of mimicking a movie theater experience I have zero interest in these and going to an actual movie theater is just infinitely better no?"
            },
            {
                "comment_id": "l124h91",
                "author": "Wildest12",
                "datetime": 1713973126.0,
                "text": "Drop the 3 at the front of the price and I’d buy one tomorrow. This is literally my most wanted tech and has been for years (the idea of well executed AR) but for me it needs to be priced far far less to consider."
            },
            {
                "comment_id": "l1265yf",
                "author": "pink_palmtrees",
                "datetime": 1713973685.0,
                "text": "Apple, no one wants to pay $3500 for the beta version that you're going to eventually upgrade and no longer allow updates past a certain point, effectively rendering it useless... do you not remember doing this to your older model iPhones and iPads? Because we do.\n\nNo thanks."
            },
            {
                "comment_id": "l12nnco",
                "author": "bap46325",
                "datetime": 1713979495.0,
                "text": "What would likely take off would be a series of cameras and (for lack of a better word) projectors that you could set up in a room to create an augmented reality free from the encumbrance of a heavy, uncomfortable headset. This is way too far away, but I just don’t see people excited to put on a headset to answer emails, take video calls and work through documents and spreadsheets when their laptop does the same just fine."
            },
            {
                "comment_id": "l0xfvsr",
                "author": "TaosMesaRat",
                "datetime": 1713897746.0,
                "text": "Apple marketer somewhere: *Maybe if we put AI sticker on it people will buy?*"
            },
            {
                "comment_id": "l0xjepx",
                "author": "TomServo31k",
                "datetime": 1713898930.0,
                "text": "Excellent. Eat shit Apple."
            },
            {
                "comment_id": "l0xbczn",
                "author": "PCP_Panda",
                "datetime": 1713896227.0,
                "text": "Can’t wait for the inevitable announcement of layoffs and the C staff being paid more after another failed product launch"
            },
            {
                "comment_id": "l0xjx94",
                "author": "nestersan",
                "datetime": 1713899106.0,
                "text": "I guess Apple learned the sheeple price limit"
            },
            {
                "comment_id": "l10kt87",
                "author": "SmileySadFace",
                "datetime": 1713946358.0,
                "text": "Apple is all brand image. The sleekness of their products and ease of use is what sells them. This clunky device is what I would expect to see in a developers desk as a prototype, not an actual commercial produt from them."
            },
            {
                "comment_id": "l0xdiw7",
                "author": "monchota",
                "datetime": 1713896954.0,
                "text": "The Isheep are finally waking up."
            },
            {
                "comment_id": "l0xk8f4",
                "author": "YinzerCy",
                "datetime": 1713899206.0,
                "text": "I love seeing stupid shit like this flop. It never gets old."
            },
            {
                "comment_id": "l0xl5ro",
                "author": "themanfromvulcan",
                "datetime": 1713899512.0,
                "text": "Sometimes Apple will try something out.  It doesn’t always work out but they learn from there.  I don’t really get the heat on this.  Nobody is being forced to buy one.  It reminds me a bit of the cylinder Mac Pro which had no slots.  Some people still bought them.  Apple was trying to push thunderbolt over slots.  It didn’t really work but I think it helped push it along.  But it wasn’t a really successful Mac Pro."
            },
            {
                "comment_id": "l0y2af9",
                "author": "Smoothstiltskin",
                "datetime": 1713905151.0,
                "text": "That headset cost more than most of my cars."
            },
            {
                "comment_id": "l0zx4vz",
                "author": "kemckai",
                "datetime": 1713931308.0,
                "text": "Why doesn’t Apple donate mini ihomes to address the housing shortage? Under threat of antitrust or paying back taxes they owe from shady corporate accounting practices in a visionary and helpful way?  Why not Amazon or Google or Microsoft? Why doesn’t Microsoft create a Government Os or computer like a Chromebook for infrastructure to streamline services?  Embedded biometrics or RSA, lightweight tough encryption. The shit at the DMV now is windows. OS Gov?   High speed rail from Wichita to El Paso ? Dallas to LA?   Legalize all drugs. License and regulate them. Build resort type places with all services to help people get clean . 1 stop shop detox and life renew. Pay it forward once you get clean by helping others do the same. Build a huge turnstile at the border and process every person with that streamlined Gov OS?  Put them to work on fixing problems. Turn prisons into ‘hard college’ real prison for the unrepentant. Invest in real at home blood and urine biometrics with aftercare. Let doctors have final say on patient care. Make every political dollar donated public. Pay politicians 1 million a year with honesty clause. Why not a space camp for the environment called earth camp to inspire young geo engineers and ecologists to figure how to cool the earth and renew the soil. Kids put in two years in NOAA they get college free. Train kids on Linux and open source. So many worthwhile things can be done, but there is no vision. We need to leverage every heart and soul on the planet to get in the game. In a world like that Vision Pro might have a real chance at being useful. We need a jobs program to fix problems. Money, status and celebrity culture are abstractions that are killing us. We are never going to survive if we don’t realize we are one. Utopia or Destruction?"
            },
            {
                "comment_id": "l0xlu22",
                "author": "OccidoViper",
                "datetime": 1713899736.0,
                "text": "Apple fans are just a cult.  They honestly get hyped up for things that already exists lol.  Like features they add on iPhone have existed in Android for several years"
            }
        ]
    },
    {
        "post_id": "1ca979i",
        "title": "Apple Vision Pro Customer Interest Dying Down at Some Retail Stores",
        "url": "https://www.macrumors.com/2024/04/22/apple-vision-pro-customer-interest-dying-down/",
        "score": 978,
        "upvotes": 978,
        "downvotes": 0,
        "num_comments": 358,
        "text": "",
        "author": "BlueLightStruct",
        "author_post_karma": 46971,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "l0qdp1y",
                "author": "petethefreeze",
                "datetime": 1713789001.0,
                "text": "Not very surprising. At this price point there are not that many people prepared to put down that much for a first generation product."
            },
            {
                "comment_id": "l0qh8sw",
                "author": "Nikiaf",
                "datetime": 1713790607.0,
                "text": "Apple really needed a killer app either at launch or shortly thereafter, or else this thing was always going to fade into a fairly obscure, niche category. Sure the technology is very impressive; but what can you actually do with it? Not having any gaming support at all; despite Apple's big push to gain relevance in that segment on the Mac, is a huge swing-and-a-miss on their part. At this point, I don't think even a non-Pro model at \\~half the price would even resuscitate the interest; because there's still nothing that can really be done with it that doesn't fall into the \"party trick\" category."
            },
            {
                "comment_id": "l0qsqbn",
                "author": "Owend12",
                "datetime": 1713795195.0,
                "text": "Huge price point + lack of apps is the standard way for a product like that to flop.\n\nEveryone should've seen this coming"
            },
            {
                "comment_id": "l0qdhi4",
                "author": "Lollipopsaurus",
                "datetime": 1713788904.0,
                "text": "We’re patiently waiting for next year’s Apple Vision Pro 2. /s"
            },
            {
                "comment_id": "l0qf9au",
                "author": "etnavyguy",
                "datetime": 1713789722.0,
                "text": "Well i mean the price is bonkers-nuts-banannas. Quest 3 is where it is at."
            },
            {
                "comment_id": "l0qgfmb",
                "author": "RDO-PrivateLobbies",
                "datetime": 1713790249.0,
                "text": "Even if this thing was $500 id have no use for it and im totally disinterested.\n\nQuest 3 is a pretty good all around headset. Its just missing oled imo."
            },
            {
                "comment_id": "l0qpcsk",
                "author": "133DK",
                "datetime": 1713793921.0,
                "text": "Still struggling to see the use case for an Apple Vision Pro\n\nIt’s a neat gadget and filled with cool tech, but it doesn’t really do anything that warrants shelling out used car levels of cash. At least in my mind, obviously others see differently, but clearly not many\n\nIt’s a solution still searching for a problem"
            },
            {
                "comment_id": "l0qv5ip",
                "author": "Abba_Fiskbullar",
                "datetime": 1713796076.0,
                "text": "It's a $3500 solution in search of a problem."
            },
            {
                "comment_id": "l0qe2du",
                "author": "trackofalljades",
                "datetime": 1713789175.0,
                "text": "This thing isn’t an iPad, it’s a Newton.\n\nWe will lavish praise on it, then yawn, then mock it, and then some years from now *everyone* will have a smaller, lighter, better, cheaper version of it."
            },
            {
                "comment_id": "l0qkbb9",
                "author": "IronChefJesus",
                "datetime": 1713791915.0,
                "text": "The VP, is, as many technology products usually are, a solution looking for a problem."
            },
            {
                "comment_id": "l0qi34e",
                "author": "wromit",
                "datetime": 1713790971.0,
                "text": "Tried it at an apple store over the weekend, and the graphics/resolution was excellent. However, just 20 min into it started hurting my face and nose. Perhaps the over-the-headstrap could reduce the pressure. Mine didn't have it. But at $3500, it is a rich person's gadget."
            },
            {
                "comment_id": "l0qinn6",
                "author": "Furqan23",
                "datetime": 1713791217.0,
                "text": "This is unsurprising to me. I own one and like it well enough but it clearly needs more time and may always remain a niche product in its current form \n\nNo real killer apps yet, mostly a bunch of tech demos\n\nThe eye tracking loses calibration if it slides up or down your head, for some apps it’s no big deal but for other apps or browsing you’re left having a hard time selecting the button/link you want \n\nThe amount of truly immersive apps and videos is still very limited. They look cool but it’ll take time to have more content \n\nI mostly use it for watching videos and even then I generally prefer my TV for that \n\nIt’s fun but not at all a must have and for the average person they can do without - not even factoring the price"
            },
            {
                "comment_id": "l0qhpsu",
                "author": "FeralPsychopath",
                "datetime": 1713790810.0,
                "text": "Interest? Sure. Paying 3k for another VR helmet? Nah I’ll think about Visor tho."
            },
            {
                "comment_id": "l0qs7bs",
                "author": "BroForceOne",
                "datetime": 1713794999.0,
                "text": "Is Apple still putting effort into blocking VR porn on this device out of the box? I’m imagining that in at least the top 3 use cases for tech dudes with $3500 of disposable income."
            },
            {
                "comment_id": "l0qlw1b",
                "author": "MrECoyne",
                "datetime": 1713792556.0,
                "text": "I read that it sucks for games and it sucks for porn, so aside from some impressive tech, it sucks."
            },
            {
                "comment_id": "l0qgt99",
                "author": "HelloItsMeXeno",
                "datetime": 1713790417.0,
                "text": "Huge flop for Apple. Companies forcing VR like 3D TVs"
            },
            {
                "comment_id": "l0qkkrj",
                "author": "iblastoff",
                "datetime": 1713792023.0,
                "text": "how much would you actually even pay for this though. even if they brought down the price 10x, i dont think i'd even buy it for 350$. the thought of having to strap a heavy device to my face just to do things in a more convoluted way sounds entirely stupid to me."
            },
            {
                "comment_id": "l0qpvdw",
                "author": "kg2k",
                "datetime": 1713794119.0,
                "text": "You had to have interest in the first place for it to die down."
            },
            {
                "comment_id": "l0qt5y9",
                "author": "anotherpredditor",
                "datetime": 1713795355.0,
                "text": "Can I watch porn with it? Apple says no. Can I play good games with it? Apple also says no. Is this for work only? Well Apple isn’t really sure how you should use it but buy one anyway."
            },
            {
                "comment_id": "l0rervv",
                "author": "GenkiElite",
                "datetime": 1713802886.0,
                "text": "Aside from everyone, who saw this coming when the price was announced?"
            },
            {
                "comment_id": "l0r1a2r",
                "author": "D0inkzz",
                "datetime": 1713798245.0,
                "text": "No surprised at all. It was a first gen overpriced test product. People with the spare change picked it up for reasons like just having the best newest stuff and too test out apples new product. Plenty of people even returned them. \n\nThere’s a few issues with it and for what they want the product to be it is too uncomfortable and large. It’s not a gaming headset it’s mostly for mixed reality production device."
            },
            {
                "comment_id": "l0rijh4",
                "author": "NaturalSelecty",
                "datetime": 1713804171.0,
                "text": "With a product like the Quest 3 available at its price point and maturity, Apple has a lot of work to do on the VPs, or they need to rethink who's going to buy this, how much they'll pay, and, more importantly, how they plan to use it.\n\nThere was never a market for how they envisioned it being used. That paired with a laughable price tag makes the VP one of the least enticing headsets on the market."
            },
            {
                "comment_id": "l0rp8c4",
                "author": "saanity",
                "datetime": 1713806461.0,
                "text": "This entire thing seemed like a marketing stunt from the beginning. They never were trying to make money off of a ridiculously expensive iPad strapped to your face. It was to have Apple being relevant in conversation and support stock prices. Looks like interest is sinking faster than Apple hoped."
            },
            {
                "comment_id": "l0ruiev",
                "author": "IndyWaWa",
                "datetime": 1713808253.0,
                "text": "just like VR."
            },
            {
                "comment_id": "l0sli72",
                "author": "dlm2137",
                "datetime": 1713819727.0,
                "text": "This thing is gonna be a huge flop."
            },
            {
                "comment_id": "l0us2rv",
                "author": "Cooldayla",
                "datetime": 1713854038.0,
                "text": "The killer app is OUTSIDE. The best commercial AR use case is to enhance reality and draw people back outside, interacting with the world as envisioned by Verner Vinge in Rainbows End.   \n  \nThe fact that Apple Vision Pro went for Business Users (to justify the costs) shows how uninspired and lacklustre Tim Cook is at the helm vs doubling down on R&D for longer to produce a smaller, mobile capable product. \n\nHere's hoping there is a product roadmap and this is phase 1 and they don't just ditch it like the Apple car... that will be a shame and another fat fail for Cook."
            },
            {
                "comment_id": "l0v764r",
                "author": "akmarinov",
                "datetime": 1713865427.0,
                "text": "You can tell that they're not looking to sell units by the fact that it's only available in the US.\n\nThey want devs to buy their devkit, they want the hype from youtube reviewers and influencers and to get some data on how people use/want to use these things.\n\nThis isn't even an Apple watch type of device - its purpose isn't to move product."
            },
            {
                "comment_id": "l0qkwsf",
                "author": "Mattna-da",
                "datetime": 1713792160.0,
                "text": "Apples first bottom up product. A technologically available solution to provide an experience no one is asking for. Rather than top down figuring out how to create a dream experience people will actually want."
            },
            {
                "comment_id": "l0qljoa",
                "author": "holman",
                "datetime": 1713792418.0,
                "text": "Vision Pro is totally nuts. I really enjoy it. But that said, it’s not even an early adopter product… it’s a *hella* early adopter product. It’s not the type of product at all to slowly build up sales; it’s going to take a version two or three, combined with well-known killer apps, combined with price cuts, to really make an impact.\n\nI think it’ll get there, but it could be a number of years away (if at all!). Apple Watch was also a bit of a slower burn, but I think that was more likely to have success than Apple Vision is, too. Gonna be interesting to see how it all plays out."
            },
            {
                "comment_id": "l0qwq2l",
                "author": "AwfulishGoose",
                "datetime": 1713796640.0,
                "text": "Not really for the average customer. I'm outside the user base for it so I don't have a need for it nor have they really defined why anyone should buy one. No one in the mainstream should. It's niche use for a niche audience.\n\nMy quest 3 suits me just fine. Hopefully the next iteration defines more mainstream reasons as to why you'd want one."
            },
            {
                "comment_id": "l0r1wn8",
                "author": "tkhan456",
                "datetime": 1713798465.0,
                "text": "I’ll be interested when it’s in the $2k range and comes with inserts for my prescription instead or making me buy that as an addon"
            },
            {
                "comment_id": "l0r2qgw",
                "author": "Futurist_312",
                "datetime": 1713798755.0,
                "text": "I can't imagine why"
            },
            {
                "comment_id": "l0r31yf",
                "author": "cozmicyeti",
                "datetime": 1713798863.0,
                "text": "Shocking /s"
            },
            {
                "comment_id": "l0rhzc7",
                "author": "likesexonlycheaper",
                "datetime": 1713803981.0,
                "text": "Lol we heard about this vision pro non stop after release and then never again. It died down a while ago."
            },
            {
                "comment_id": "l0s3gka",
                "author": "IceFire2050",
                "datetime": 1713811298.0,
                "text": "How much interest could their possibly be for $3500 VR Goggles when you can get a Quest 2 for $200 or a Quest 3 for $500?\n\nVR is a niche market to begin with, and it's not exactly a thriving market."
            },
            {
                "comment_id": "l0s4xlh",
                "author": "LondonDavis1",
                "datetime": 1713811801.0,
                "text": "Pretty sure 90% of them went to influencers for a real-world tested review."
            },
            {
                "comment_id": "l0s8ow6",
                "author": "cbaxal",
                "datetime": 1713813089.0,
                "text": "It’s just too expensive. I’m a fan of Apple and VR/AR but I wouldn’t spend the kind of money they want for it, especially a gen 1 product. I like a lot of what I see and I feel like there is still so much untapped potential with this product but it’s not here yet. Even 50% off would be a lot. Unless I know I could replace my computer for it and would prefer using the Vision Pro then I’m waiting."
            },
            {
                "comment_id": "l0sazxh",
                "author": "tonynca",
                "datetime": 1713813880.0,
                "text": "Another flop imo. People don’t need this."
            },
            {
                "comment_id": "l0sccx7",
                "author": "w8cycle",
                "datetime": 1713814346.0,
                "text": "The price is just too high to justify the purchase. For the price of the Vision I could get a top of the line gaming PC or even a car."
            },
            {
                "comment_id": "l0siv4t",
                "author": "stever71",
                "datetime": 1713816589.0,
                "text": "Of course it is, VR/AR is a niche product and this is also very expensive.\n\nAs I've said many times, this stuff will never be mainstream, yet they waste billions on it."
            },
            {
                "comment_id": "l0smsp6",
                "author": "Centralredditfan",
                "datetime": 1713820240.0,
                "text": "Well yea, it's too much money for a toy with limited use. \n\nI'd love a version for less than $500 that would act as a display for my existing work laptop. Especially since I could only justify it for work. (And maybe gaming)"
            },
            {
                "comment_id": "l0t7kbj",
                "author": "East1st",
                "datetime": 1713828195.0,
                "text": "Tried it in-store. It’s an incredible device, but felt uncomfortable after about 15 min. It needs to get a whole lot lighter and cheaper before the mass market joins in."
            },
            {
                "comment_id": "l0terlb",
                "author": "aslittledesign",
                "datetime": 1713831071.0,
                "text": "I bought it. Very impressive technology. Very uncomfortable, and a really shallow App Store. I returned it. No regrets, I’ll give it a few years and maybe try it again then."
            },
            {
                "comment_id": "l0tu0fl",
                "author": "MCDZ-MayorMcCheese",
                "datetime": 1713837093.0,
                "text": "Who could have seen this coming????"
            },
            {
                "comment_id": "l0txhqt",
                "author": "lpjayy12",
                "datetime": 1713838435.0,
                "text": "Really? I’m surprised being how affordable it is"
            },
            {
                "comment_id": "l0ty15m",
                "author": "cityofthedead1977",
                "datetime": 1713838640.0,
                "text": "Shit like this will ownly become popular when they get to the size of sun glasses."
            },
            {
                "comment_id": "l0ugepi",
                "author": "BellTT",
                "datetime": 1713846959.0,
                "text": "I haven't seen too many videos lately of people running around in them"
            },
            {
                "comment_id": "l0uig7l",
                "author": "Joebebs",
                "datetime": 1713848007.0,
                "text": "I’ll get it when it’s 95% off. only 5% of this country is willing to get a VR headset. <1% of this country is willing to get an AR headset let alone a 3500$ apple headset"
            },
            {
                "comment_id": "l0uul2a",
                "author": "owen__wilsons__nose",
                "datetime": 1713855804.0,
                "text": "I think a lot of people expected it to succeed because Apple hasn't launched a failed product in its modern era. This might be the first and that nobody is infallible"
            },
            {
                "comment_id": "l0vaoii",
                "author": "arjunyg",
                "datetime": 1713867908.0,
                "text": "You could write “interest in *insert new tech product* wanes months after launch” about basically any tech product 😵‍💫\n\n1. CPUs\n2. GPUs\n3. New phones\n4. New laptops\n5. whatever else\n\ncringe article"
            },
            {
                "comment_id": "l0qg8jm",
                "author": "fourleggedostrich",
                "datetime": 1713790163.0,
                "text": "What a non-story."
            },
            {
                "comment_id": "l0sal64",
                "author": "dethnight",
                "datetime": 1713813741.0,
                "text": "I think Zuck was right when he said the Quest 3 is not just better for it's price, but it is actually the better product altogether.  I use the Quest 3 mostly for gaming, what are people supposed to use the Vision Pro for?"
            },
            {
                "comment_id": "l0sbig6",
                "author": "Global_Felix_1117",
                "datetime": 1713814055.0,
                "text": "1 month and 1 half, that's how long hype lasts. That's how long bullshit can stand before it flops on the ground."
            },
            {
                "comment_id": "l0qs87w",
                "author": "Altruistic_Party2878",
                "datetime": 1713795008.0,
                "text": "This and and cyber truck , which is the worse blunder from a business standpoint ?"
            },
            {
                "comment_id": "l0r372i",
                "author": "jonr",
                "datetime": 1713798912.0,
                "text": "No shit. $4000 and you can't play your games on it."
            },
            {
                "comment_id": "l0roosx",
                "author": "Ricothebuttonpusher",
                "datetime": 1713806276.0,
                "text": "Lemme tell you why…it costs $3500"
            },
            {
                "comment_id": "l0ra8a5",
                "author": "xsniperx7",
                "datetime": 1713801330.0,
                "text": "Wait there was interest????? Outside of influencers buying for clout and clicks there was interest from consumers??????????????? I have my doubts"
            },
            {
                "comment_id": "l0qib1v",
                "author": "Regret-Select",
                "datetime": 1713791068.0,
                "text": "I'd imagine if you had the money and interest, you own it already\n\nWay too expensive for most normal people. Price will have to decrease to see more people getting involved\n\nOnly other complaint ap far would be the battery pack"
            },
            {
                "comment_id": "l0qo5mf",
                "author": "yParticle",
                "datetime": 1713793456.0,
                "text": "Novelty product isn't novel any more?"
            },
            {
                "comment_id": "l0qpgck",
                "author": "encom-direct",
                "datetime": 1713793959.0,
                "text": "Was always interested but could never afford one. I assume this applied to most people"
            },
            {
                "comment_id": "l0qpgdb",
                "author": "Beneficial-Salt-6773",
                "datetime": 1713793960.0,
                "text": "Reduce the price to $300 and I might consider."
            },
            {
                "comment_id": "l0qq2sp",
                "author": "captainpotatoe",
                "datetime": 1713794197.0,
                "text": "I have an industrial application to be able to use it to show clients machine designs but that would pull it out of its case maybe once every 2 months. Thats about all I think I could use one for"
            },
            {
                "comment_id": "l0qqrpn",
                "author": "beland-photomedia",
                "datetime": 1713794459.0,
                "text": "I’d rather have an interactive holodeck than these hyperreality dork goggles."
            },
            {
                "comment_id": "l0qqt89",
                "author": "djphatjive",
                "datetime": 1713794475.0,
                "text": "Over engineered and way over priced. I love Apple products but this is way over the top for no reason. Like others have said. Show me an app that it uses that needs all that hardware? There isn’t one."
            },
            {
                "comment_id": "l0qs41m",
                "author": "The-Protomolecule",
                "datetime": 1713794965.0,
                "text": "For me, this is awful, but the killer app is panorama photos. I use lots of panos for things being built at work and it helps save me flights around the country.\n\nThat should make the app problem clear."
            },
            {
                "comment_id": "l0qu1cg",
                "author": "ctudor",
                "datetime": 1713795674.0,
                "text": "to be expected, a lot of money and not a lot of things you can do with it. but as software stack expands i think it has the potential to be used in productivity for different applications."
            },
            {
                "comment_id": "l0quust",
                "author": "fiddlerisshit",
                "datetime": 1713795968.0,
                "text": "I have yet to see a single person wearing an Apple Vision Pro in real life. Apple has got more marketing to do."
            },
            {
                "comment_id": "l0qwnoo",
                "author": "The_real_bandito",
                "datetime": 1713796616.0,
                "text": "Like expected. "
            },
            {
                "comment_id": "l0qyovv",
                "author": "chads3058",
                "datetime": 1713797338.0,
                "text": "Well, it’s $3500 and people are realizing that, although it’s very cool, it doesn’t really do much right now"
            },
            {
                "comment_id": "l0qz1qk",
                "author": "ISAMU13",
                "datetime": 1713797464.0,
                "text": "AR/VR are not a “sticky” technology, especially at that price point with few killer apps."
            },
            {
                "comment_id": "l0r5rtj",
                "author": "falsesabbath",
                "datetime": 1713799805.0,
                "text": "I tried this thing over the weekend. The technology is incredibly impressive and it's the first time in years I really felt like an Apple product was \"new\".\n\nRight now, it only serves a home theatre replacement (without HDMI), a very expensive in-flight entertainment system, or an enterprise device. It's handicapped by price and utility. But that won't be the case forever, especially once it expands into new form factors."
            },
            {
                "comment_id": "l0r7tbe",
                "author": "TheNinjaTurkey",
                "datetime": 1713800507.0,
                "text": "It's crazy that they thought this would be the next generation in computing when the thing costs $3500. The iPhone did so well because it was affordable and actually useful. The tech in the vision pro is cool but they're out of their minds if they think this is going to be the next big thing."
            },
            {
                "comment_id": "l0r8e6f",
                "author": "HaiKarate",
                "datetime": 1713800705.0,
                "text": "The price is ridiculous. The only consumers that are buying them are the hardcore, early adopter Apple fanbois.\n\nI still maintain that Apple's intention with this was to soak the developers who would just write it off as a business expense, and to fleece the fanbois as a bonus. And then gen 2 or gen 3 would be priced for the consumer market, maybe around $1000. And there would be a good amount of software available.\n\nAfter all, naming the first version \"Pro\" suggests that the average consumer was not the target. No doubt the consumer version will have some cost-cutting measures, like losing the front-facing screen and maybe the glass front, that really don't serve a purpose."
            },
            {
                "comment_id": "l0r8h7l",
                "author": "poopyfacemcpooper",
                "datetime": 1713800734.0,
                "text": "I forgot it existed like the cyber truck "
            },
            {
                "comment_id": "l0r8w45",
                "author": "marklondon66",
                "datetime": 1713800876.0,
                "text": "Demand for expensive 1st gen product with limited use declining. Amazing!"
            },
            {
                "comment_id": "l0r91w5",
                "author": "NeedzFoodBadly",
                "datetime": 1713800930.0,
                "text": "Golly, people don't want to spend 3k PLUS so they can read their emails and \"play\" Garage Band in VIRTUAL REALITY...or just walk around like a jackass in public while using it as a fashion accessory? I thought for sure this was a winning business model."
            },
            {
                "comment_id": "l0rbjzy",
                "author": "TheSpatulaOfLove",
                "datetime": 1713801781.0,
                "text": "Gen 3 improvements and cost will likely bring more buyers to the table.  \n\nI can see myself buying one for movie consumption on international flights, provided it’s cost effective and lighter weight."
            },
            {
                "comment_id": "l0rbsfg",
                "author": "Mano9634",
                "datetime": 1713801862.0,
                "text": "I don’t think anyone is surprised the Vision Pro felt like a public device kit release."
            },
            {
                "comment_id": "l0rd44e",
                "author": "Shapes_in_Clouds",
                "datetime": 1713802319.0,
                "text": "AVP needs AR versions of the iLife apps.  It needs an AR Final Cut. \n It needs unique AVP versions of their services apps.  Apple needs to lead the way on software development and how best to design applications around this new UX paradigm.  \n\nGiven Apple's tepid approach to the iPad and their failure to establish a coherent multitasking system across three-plus different implementations doesn't give me confidence."
            },
            {
                "comment_id": "l0rdbm3",
                "author": "getBusyChild",
                "datetime": 1713802390.0,
                "text": "It would have been amazing if a user could, let's say, watch games but also be in the crowd with other Pro users. I think that would have been interesting.\n\nBut Apple will make up the cost by selling an even more variety of watch bands for overpriced figures."
            },
            {
                "comment_id": "l0reqxp",
                "author": "OriginalGear2006",
                "datetime": 1713802877.0,
                "text": "Apple needs their own version of the Meta Ray-Ban Smart glasses."
            },
            {
                "comment_id": "l0rg3wq",
                "author": "biodigitaljaz",
                "datetime": 1713803341.0,
                "text": "People don't want to wear gadgets. Present us with force reactive holographic technology. AKA The Holodeck, and then you'll have the audience."
            },
            {
                "comment_id": "l0rh2yw",
                "author": "ROGER_CHOCS",
                "datetime": 1713803674.0,
                "text": "Gonna be a good collectors item one day."
            },
            {
                "comment_id": "l0riqh9",
                "author": "heybart",
                "datetime": 1713804238.0,
                "text": "Like the Watch, Apple doesn't have a clear compelling use case for the VP on launch.  They take the if you build it, theyll come attitude. They figured they would put the hardware and platform out there and let devs figure out what to do with it and let it grow organically\n\nThis approach worked for the watch. But that's because lots of people want a fitness tracker anyway and here's a fancy one that integrates nicely with your iPhone and lets you take calls and read messages in a pinch. Also very handy for pinging your iPhone. The Watch is pretty damn successful though it's not much talked about.\n\nIt's not working out for the VP, because for one thing it costs 3500$. Nobody NEEDS this thing. Apple could've targeted professionals e.g. medicine or engineering but they wanted consumers instead. They could've targeted gamers but they didn't probably b/c other companies are doing it already. It's a general consumer device that's too expensive with no killer app on launch. Because it's too expensive with too few users, devs have a hard time justifying even buying one to explore it, much less spending more resources to develop for it. Developing for iOS devices is already a pita. This has to be pita to 11.\n\nIf Apple wants this to succeed, THEY have to put in the work and develop stuff for it. THEY have to put in more money to create content like immersive sports to show how cool this stuff is. A few demos in the app store won't cut it. They need to put out fresh content like every month at least. They have to show they're all in on this themselves if they want other people to buy in"
            },
            {
                "comment_id": "l0rjqoi",
                "author": "sentientgorilla",
                "datetime": 1713804582.0,
                "text": "I’ll get it if the price drops. But Oculus already does what I need it to do."
            },
            {
                "comment_id": "l0rlld7",
                "author": "f8Negative",
                "datetime": 1713805212.0,
                "text": "Customer interest is dead"
            },
            {
                "comment_id": "l0rnpnb",
                "author": "Superior_Light_Deer",
                "datetime": 1713805942.0,
                "text": "Maybe I’m getting old but I’m just not interested in these at all."
            },
            {
                "comment_id": "l0rqqrq",
                "author": "fillemoinkes",
                "datetime": 1713806974.0,
                "text": "No shit Sherlock"
            },
            {
                "comment_id": "l0s5csk",
                "author": "Dat1BlackDude",
                "datetime": 1713811947.0,
                "text": "It’s a niche device with a very high price tag, and no killer app. I knew the hype would die down rather quickly. As it just isn’t a device most people should buy."
            },
            {
                "comment_id": "l0s9en5",
                "author": "SophieDaDoggo",
                "datetime": 1713813339.0,
                "text": "People that have one, how often do you use yours and do you see it taking off with general public?"
            },
            {
                "comment_id": "l0scnkl",
                "author": "Galactic-toast",
                "datetime": 1713814449.0,
                "text": "I'll wait for a non-pro version"
            },
            {
                "comment_id": "l0sdi9z",
                "author": "LoserBroadside",
                "datetime": 1713814745.0,
                "text": "The Apple Vision Pro is a bad solution in search of a problem so dire that a bad solution is preferable to no solution."
            },
            {
                "comment_id": "l0sh17k",
                "author": "Urban_Archeologist",
                "datetime": 1713815947.0,
                "text": "Trillion dollar company develops new tech and figures out how to have the public pay to test market it.  \n\n“Cheapness” and “Genius” do rhyme if anyone would like to drop a beat."
            },
            {
                "comment_id": "l0tu6x4",
                "author": "Poorcat42",
                "datetime": 1713837164.0,
                "text": "I thought when apple finally brought their VR to market it would be sleeker, cooler, and more for the masses. This is still an early adopter type tech. Steve Jobs would have pushed for something more ground breaking, something set far above and apart from the competition. This is just a fancier version of stuff that’s already on the market smh."
            },
            {
                "comment_id": "l0uc30o",
                "author": "MGPS",
                "datetime": 1713844785.0,
                "text": "Once they add copy/paste….im in!"
            },
            {
                "comment_id": "l0uiw5f",
                "author": "buyongmafanle",
                "datetime": 1713848253.0,
                "text": "Because every single VR product has the same three problems\n\n1 - Lack of interesting software\n\n2 - Shitty UI compared to a keyboard and mouse or controller\n\n3 - No real benefit over a flat screen"
            },
            {
                "comment_id": "l0v44ku",
                "author": "pppjurac",
                "datetime": 1713863097.0,
                "text": "How much does it cost?\n\nYes buddy, that is the answer."
            },
            {
                "comment_id": "l0v570h",
                "author": "fvckCrosshairs",
                "datetime": 1713863919.0,
                "text": "What a flop"
            },
            {
                "comment_id": "l0qjp0e",
                "author": "RedditCollabs",
                "datetime": 1713791656.0,
                "text": "Oh my God I am so surprised the non-average consumer focused $4000 headset has demand dying down after selling hundreds of thousands.\n\nThis just in, Lamborghini only sells a few hundred cars a year! Oh no!"
            },
            {
                "comment_id": "l0qfh82",
                "author": "Groundbreaking_Pop6",
                "datetime": 1713789823.0,
                "text": "My local sweet shop hasn’t sold any of these, or ever been asked for one, so I must agree with the headline."
            },
            {
                "comment_id": "l0qkr39",
                "author": "MadOrange64",
                "datetime": 1713792096.0,
                "text": "Apple needs to release the consumer friendly priced Vision device as soon as possible. $3500 is just too much for niche device."
            },
            {
                "comment_id": "l0qn164",
                "author": "EastObjective9522",
                "datetime": 1713793013.0,
                "text": "Remember Google Glass? This is just Apple's vision of Google Glass but with extra steps."
            },
            {
                "comment_id": "l0qqidm",
                "author": "bigsmooth66",
                "datetime": 1713794360.0,
                "text": "They should drastically reduce the price to about $200 and license the exclusive content rights to movie studios, sports broadcasters, concert venues, etc. \n\nNo one wants to pay $3000 for a wearable \"productivity device\". I want to be removed from reality, not reminded of it."
            },
            {
                "comment_id": "l0qulen",
                "author": "blancpainsimp69",
                "datetime": 1713795874.0,
                "text": "I'm a massive tech cynic and I thought it was cool as hell. But...yeah, what do you do with it? We haven't figured that out yet. I don't doubt AR will have some kind of future but it's not immediately clear what kind"
            },
            {
                "comment_id": "l0qv5uv",
                "author": "Old-Ad-3268",
                "datetime": 1713796080.0,
                "text": "These VR/AR headsets are so stupid and can only be used if your alone. Wearing one of these in any public setting, even having friends over, is so lame."
            },
            {
                "comment_id": "l0tzxsy",
                "author": "NeuralPhysics",
                "datetime": 1713839379.0,
                "text": "cone fool kind spam"
            },
            {
                "comment_id": "l0qec9h",
                "author": "DangerousAd1731",
                "datetime": 1713789303.0,
                "text": "Just seems like a lot of cash money records"
            },
            {
                "comment_id": "l0qt55p",
                "author": "StanGable80",
                "datetime": 1713795347.0,
                "text": "So like every product in the history of mankind?"
            },
            {
                "comment_id": "l0t48qp",
                "author": "cjorgensen",
                "datetime": 1713826874.0,
                "text": "So three months on interest is dying down? Seems pretty long for a product people said no one would buy except developers."
            },
            {
                "comment_id": "l0qdoap",
                "author": "SpeciesSapien",
                "datetime": 1713788991.0,
                "text": "No body is going to wrap a VR/AR headset for 8 to 10 hours per day....\nWe have learned enough from the DEVIL also known as SMARTPHONE...."
            }
        ]
    },
    {
        "post_id": "1c02sgt",
        "title": "Some Apple Vision Pro users suffer black eyes, headaches and neck pain",
        "url": "https://www.marketwatch.com/story/some-apple-vision-pro-userssufferblack-eyes-headaches-and-neck-pain-626291fc",
        "score": 1631,
        "upvotes": 1631,
        "downvotes": 0,
        "num_comments": 223,
        "text": "",
        "author": "chrisdh79",
        "author_post_karma": 9564306,
        "tag": "Hardware",
        "comments": [
            {
                "comment_id": "kyua78r",
                "author": "Ogremad",
                "datetime": 1712703155.0,
                "text": "For crying out loud, take it off!"
            },
            {
                "comment_id": "kyu2whf",
                "author": "Brian_K9",
                "datetime": 1712700402.0,
                "text": "Its like we werent ment to have a computer strapped to our heads for hours on end "
            },
            {
                "comment_id": "kytr9we",
                "author": "Brave-Tangerine-4334",
                "datetime": 1712696282.0,
                "text": "Can you bruise just from something resting against your skin?  Surely this has been exacerbated by some condition."
            },
            {
                "comment_id": "kyu88kj",
                "author": "trailhopperbc",
                "datetime": 1712702407.0,
                "text": "Slow news day at marketwatch??"
            },
            {
                "comment_id": "kyu8jix",
                "author": "porkbellymaniacfor",
                "datetime": 1712702523.0,
                "text": "This is a no brainer. It’s like getting the newest edition of a Tesla. You’re the Guinea pig and there will be problems."
            },
            {
                "comment_id": "kyup4oc",
                "author": "Miserable_Ride666",
                "datetime": 1712708953.0,
                "text": "Where masturbating will actually make you go blind"
            },
            {
                "comment_id": "kyuxobu",
                "author": "YT-Deliveries",
                "datetime": 1712712281.0,
                "text": "r/VRtoER smoking in the corner with a knowing smile"
            },
            {
                "comment_id": "kyx8zf8",
                "author": "WitteringLaconic",
                "datetime": 1712758057.0,
                "text": "Whoever would have thought that putting a heavy object on your head where the weight favours one side of it would give you headaches and neck pain?"
            },
            {
                "comment_id": "kyx5fbg",
                "author": "penguished",
                "datetime": 1712756715.0,
                "text": "It would be cool if VR headsets made sense physically, the problem is they just don't at this point. Whatever discomfort people put up with using monitors and cellphones is really trivial compared to encasing your face in something."
            },
            {
                "comment_id": "kytsg9g",
                "author": null,
                "datetime": 1712696674.0,
                "text": "[deleted]"
            },
            {
                "comment_id": "kyv0do8",
                "author": "gorkt",
                "datetime": 1712713352.0,
                "text": "I am a big Apple fan but I don’t understand how this is something that the average person gains value from."
            },
            {
                "comment_id": "kyu9s5u",
                "author": "TeslasAndComicbooks",
                "datetime": 1712702995.0,
                "text": "Define “some”. I’ve had no problems with mine. Is it less than 1% of users? People wearing them all day?"
            },
            {
                "comment_id": "kyuqz2n",
                "author": "SirCaptainReynolds",
                "datetime": 1712709647.0,
                "text": "This is the stupidest shit I’ve heard all day. They made of paper or something? Use mine daily and somehow manage not to break my neck or get black eyes regularly. Look at me go."
            },
            {
                "comment_id": "kyvc6sx",
                "author": "LtJimmyRay",
                "datetime": 1712718242.0,
                "text": "I'm having Virtual Boy flashbacks"
            },
            {
                "comment_id": "kyve64a",
                "author": "Foojira",
                "datetime": 1712719148.0,
                "text": "You were not invited SLICE"
            },
            {
                "comment_id": "kyx0ukj",
                "author": "snowcrash512",
                "datetime": 1712754868.0,
                "text": "I'm guessing this is true for every single VR headset, there will always be a small number of people that it causes problems for, every wearable item from clothing to headphones is like this for a handful of people out there who happen to have unusual anatomy or something that just puts them outside normal product ranges.  Hell I can't wear 95 percent of hats out there without getting a horrible headache because of my stupidly oversized head."
            },
            {
                "comment_id": "kyuk0h0",
                "author": "mingy",
                "datetime": 1712706961.0,
                "text": "Headaches should scarcely be a surprise. It is an unfortunate reality that a lot of people get VR sickness."
            },
            {
                "comment_id": "kyu2b72",
                "author": "umthondoomkhlulu",
                "datetime": 1712700187.0,
                "text": "Sitting is not good for your health either."
            },
            {
                "comment_id": "kyvh8bo",
                "author": "afrothundah11",
                "datetime": 1712720595.0,
                "text": "No matter what tech they improve nothing will change the fact you are looking at a screen 1” from your eyes.\n\nWe all know the downside to staring at a computer screen and what that can do to our vision, why don’t people clue in to the fact that no matter what screen they put there it’s a bad thing.\n\nStop trying to make VR happen, it sucks and ALWAYS will, no matter what."
            },
            {
                "comment_id": "kyuckvv",
                "author": "mjh2901",
                "datetime": 1712704073.0,
                "text": "I get motion sickness as much as I love the idea of Vision Pro I dont see any ability to use it for a long enough time to justify the cost."
            },
            {
                "comment_id": "kyumczr",
                "author": "trackofalljades",
                "datetime": 1712707877.0,
                "text": "Sore Body Problem?"
            },
            {
                "comment_id": "kyv9ekj",
                "author": "stickytrackpad",
                "datetime": 1712717028.0,
                "text": "black eyes..? are they shoving the strap fastener in a door and yanking their heads?"
            },
            {
                "comment_id": "kyv9wv6",
                "author": "TheRoyalCoolness",
                "datetime": 1712717247.0,
                "text": "Yes It was reported"
            },
            {
                "comment_id": "kyvfz5o",
                "author": "Burpreallyloud",
                "datetime": 1712719994.0,
                "text": "And that’s after just seeing the receipt for the purchase."
            },
            {
                "comment_id": "kyvne96",
                "author": "Ryfhoff",
                "datetime": 1712723799.0,
                "text": "Been a migraine guy since I was a kid. On some pretty powerful meds and I can’t ever think of owning one of these. I tried some AR glasses and those got returned in one day. Kinda sucks ,  but it is what it is for me."
            },
            {
                "comment_id": "kyvoo9d",
                "author": "The-Protomolecule",
                "datetime": 1712724524.0,
                "text": "I will be honest, I think black eyes are people misjudging the size and moving wearing it, they walk into a wall or something.\n\nI don’t think the weight is giving a proper black eye."
            },
            {
                "comment_id": "kyw6sz2",
                "author": "TeamDeath",
                "datetime": 1712737058.0,
                "text": "Suprise suprise a heavy screen right infront of your eyes is bad for you"
            },
            {
                "comment_id": "kyw73tn",
                "author": "NFTArtist",
                "datetime": 1712737295.0,
                "text": "Is this a Vision issue because I've never heard about this with other VR headsets."
            },
            {
                "comment_id": "kywjdm8",
                "author": "SirLawrenceCCLXX",
                "datetime": 1712746251.0,
                "text": "Yeah no shit"
            },
            {
                "comment_id": "kywn2bj",
                "author": "HotgunColdheart",
                "datetime": 1712748396.0,
                "text": "Guess they werent raised around a Nintendo Virtual Boy."
            },
            {
                "comment_id": "kywsdvo",
                "author": "mightysashiman",
                "datetime": 1712751103.0,
                "text": "I say, how utterly suprising"
            },
            {
                "comment_id": "kyxp5kh",
                "author": "attack_the_block",
                "datetime": 1712763779.0,
                "text": "This seems pointless until it is as easy to wear as a pair of glasses."
            },
            {
                "comment_id": "kyxwoq3",
                "author": "magicnmind2",
                "datetime": 1712766427.0,
                "text": "Carpel Neck Syndrome"
            },
            {
                "comment_id": "kyy3k1r",
                "author": "BKLounge",
                "datetime": 1712768777.0,
                "text": "Not new issues to anyone who has used VR in the last 10 years."
            },
            {
                "comment_id": "kyyf414",
                "author": "gc28",
                "datetime": 1712772716.0,
                "text": "‘Some’ used in a news article is an instant red flag 🚩\n\nGive numbers or don’t write it."
            },
            {
                "comment_id": "kyys49u",
                "author": "nopantsgomez",
                "datetime": 1712777039.0,
                "text": "Maybe soybot can hold it for them"
            },
            {
                "comment_id": "kyyscno",
                "author": "ghandi3737",
                "datetime": 1712777116.0,
                "text": "Are the black eyes from bumping into walls?"
            },
            {
                "comment_id": "kyz9ra0",
                "author": "DyslexicFartSmeller",
                "datetime": 1712782824.0,
                "text": "They all walked into walls"
            },
            {
                "comment_id": "kz082ba",
                "author": "littleMAS",
                "datetime": 1712795599.0,
                "text": "This gives Apple a black eye, too."
            },
            {
                "comment_id": "kz0htzf",
                "author": "TuffNutzes",
                "datetime": 1712799361.0,
                "text": "So Apple created the modern Opti-grab."
            },
            {
                "comment_id": "kz17xlj",
                "author": "Gabemiami",
                "datetime": 1712811256.0,
                "text": "Maybe Apple will get it right after a few generations. I’ll wait."
            },
            {
                "comment_id": "kz3shze",
                "author": "Helpful-User497384",
                "datetime": 1712855993.0,
                "text": "also buyers remorse by wasting all that money and should have just got a meta quest 3 instead."
            },
            {
                "comment_id": "kyv5eyl",
                "author": "Puzzleheaded-Page140",
                "datetime": 1712715371.0,
                "text": "Its almost as if the real world is better seen with eyes, which specifically evolved for this purpose over millions of years, rather than 'our most advanced display ever. We think you're going to love it'. Almost."
            },
            {
                "comment_id": "kyusm8t",
                "author": "korosuzo815",
                "datetime": 1712710286.0,
                "text": "…after their girlfriends beat the shit out of them for being losers."
            },
            {
                "comment_id": "kyug3ag",
                "author": "OddNugget",
                "datetime": 1712705431.0,
                "text": "Give it a bit more time and this will read: \n\n\"~~Some~~ Apple Vision Pro users suffer black eyes, headaches and neck pain\""
            },
            {
                "comment_id": "kyuli6a",
                "author": "Daimakku1",
                "datetime": 1712707544.0,
                "text": "I love the idea of emulating a movie theater experience with these headsets but all the drawbacks they have makes it not worth it."
            },
            {
                "comment_id": "kyunu0f",
                "author": "vacuous_comment",
                "datetime": 1712708452.0,
                "text": "And somehow I am supposed to care about that?"
            },
            {
                "comment_id": "kyvz628",
                "author": "pryvisee",
                "datetime": 1712731293.0,
                "text": "Man I pictured “black eyes” in this sentence as turning peoples eyes black, not bruising lol"
            },
            {
                "comment_id": "kywfmmj",
                "author": "TheMireMind",
                "datetime": 1712743772.0,
                "text": "Here's my surprised face.\n\n  \nWe've peaked on necessary tech for now.  We're trying to turn gimmicks into necessities and it's failing miserably."
            },
            {
                "comment_id": "kyuiz3e",
                "author": "tommygunz007",
                "datetime": 1712706550.0,
                "text": "and a chapped right hand. :-)"
            },
            {
                "comment_id": "kyuygc6",
                "author": "niz-ar",
                "datetime": 1712712590.0,
                "text": "Apple has just fallen off haven’t they. I used to love their products, worked there during their “prime” years and it just seems like they can’t do it anymore"
            },
            {
                "comment_id": "kyva50u",
                "author": "Whatwhyreally",
                "datetime": 1712717345.0,
                "text": "Reason 846 why I won’t buy a VR/AR anything R headset."
            },
            {
                "comment_id": "kyu4fw8",
                "author": "TimingAndBodyControl",
                "datetime": 1712700977.0,
                "text": "Probably misinformation that started on Meta"
            },
            {
                "comment_id": "kyvd3t9",
                "author": "Right-Ad8729",
                "datetime": 1712718658.0,
                "text": "These big cooperation only care abt profits nd not a fck abt their customers"
            },
            {
                "comment_id": "kyvndb8",
                "author": "sadbutmakeyousmile",
                "datetime": 1712723784.0,
                "text": "Can't wait to never hear this news again !"
            },
            {
                "comment_id": "kyvoh9v",
                "author": "sakredfire",
                "datetime": 1712724412.0,
                "text": "So like any other computer"
            },
            {
                "comment_id": "kyx5elu",
                "author": "Hypnotist30",
                "datetime": 1712756707.0,
                "text": "That woman has never had a black eye."
            },
            {
                "comment_id": "kyy66sp",
                "author": "alf0nz0",
                "datetime": 1712769684.0,
                "text": "I literally forgot this thing even existed. Hasn’t had quite the impact they were hoping for, I’d say. iPads seemed stupid at first, too, but at least you saw them IRL pretty much immediately after they were released."
            },
            {
                "comment_id": "kyu60k1",
                "author": "teddytwelvetoes",
                "datetime": 1712701560.0,
                "text": ">Emily Olman got her $3,500 device in February and told MarketWatch that it gave her two black eyes after she wore it for the first time for about an hour.  \n>  \n>“I wasn’t able to use it very much the first few weeks because the fit was just off,” said Olman, chief media officer at Hopscotch Interactive, who is based in Kensington, Calif. Olman creates videos with the device for commercial and residential real-estate clients.  \n>  \n>She added that she had “like, superdark black eyes,” after wearing the Apple Vision Pro, which, she said, “clearly \\[placed\\] too much weight on my cheeks.”  \n>  \n>Olman is not the only user pained by Apple’s new VR device. Ian Beacraft, CEO of consulting firm Signal and Cipher, felt soreness at the base of his skull and in his upper back after a two-hour session, he said in an interview. He blamed the fit of the Apple gadget.\n\nwhat are the chances that these two users would've spent $3,500 on an identical product from any other computer hardware manufacturer? what are the chances that they'd even know that it existed in the first place?"
            },
            {
                "comment_id": "kyu6ovi",
                "author": "zer04ll",
                "datetime": 1712701814.0,
                "text": "bummer, I did want to get one for dev work but Ill wait till the next version"
            },
            {
                "comment_id": "kyue7sj",
                "author": "RogueJello",
                "datetime": 1712704706.0,
                "text": "What about the apple fans wearing the vision pro? Surely that protected them during the beating?"
            },
            {
                "comment_id": "kywso23",
                "author": null,
                "datetime": 1712751238.0,
                "text": "[removed]"
            },
            {
                "comment_id": "kytyp6l",
                "author": "_TeddyBarnes_",
                "datetime": 1712698874.0,
                "text": "That’s because the users that purchased this are usually weak pathetic sickly scrawny little excuse for humans who literally die at the sight and scent of a fucking peanut."
            },
            {
                "comment_id": "kyu4i5q",
                "author": "djphatjive",
                "datetime": 1712701000.0,
                "text": "This is going to be Tim Cook’s downfall, and the 10 billion spent on an Apple car. I give it 1 year and he will be replaced."
            }
        ]
    }
]